[{"name": "Acko", "socials": [["Website", "https://acko.com/"], ["Twitter", "https://twitter.com/AckoInsurance"], ["LinkedIn", "https://linkedin.com/company/acko/"]], "founded": "2016", "employees": "501 - 1K", "about": "ACKO is India’s first and fastest-growing InsurTech company which makes buying and using insurance effortlessly. It was founded in 2016 by Mr. Varun Dua- a serial fintech entrepreneur who set simplicity, affordability, and innovation as its cornerstones. In a short span since its inception, Acko has partnered with major tech companies like Amazon, OYO, and Ola, and is renowned for its innovative insurance products. The company is backed by Amazon, Accel, Catamaran Ventures, SAIF Partners, Swiss Re Transamerica Ventures, and seasoned investors like Ashish Dhawan, Kris Gopalakrishnan, Hemendra Kothari, Atul Nishar, Rajeev Gupta, Venk Krishnan, and Subba Rao. Its latest round of funding has also added Binny Bansal, RPS ventures, and Intact ventures to its list of investors. Recently, ACKO has won the Golden Peacock Award for innovative product and service, has been featured in LinkedIn’s top 25 startups in India list, Business Today’s Coolest Startups list, and won the Entrepreneur 2019 Startup of the year- Fintech Award.", "statement": "", "values": "", "offer": []}, {"name": "Adobe", "socials": [["Website", "https://adobe.com/"], ["Twitter", "https://twitter.com/Adobe"], ["LinkedIn", "https://linkedin.com/company/adobe"]], "founded": "1982", "employees": "10K+", "about": "Adobe is an American multinational computer software company and a global leader in digital media and digital marketing solutions. Their creative, marketing and document solutions empower people to bring digital creations to life and deliver immersive, compelling experiences to the right person at the right moment for the best results.", "statement": "", "values": "GenuineWe are sincere, trustworthy, and reliable. ExceptionalWe’re committed to creating exceptional experiences that delight our employees and customers. InnovativeWe’re highly creative and always striving to connect new ideas with business realities. InvolvedWe’re inclusive, open, and actively engaged with our customers, partners, employees, and the communities we serve.  ", "offer": []}, {"name": "Airbnb", "socials": [["Website", "https://airbnb.com/"], ["Twitter", "https://twitter.com/Airbnb"], ["LinkedIn", "https://linkedin.com/company/airbnb"]], "founded": "2007", "employees": "10K+", "about": "Airbnb is a global community of Hosts and travelers, a community that was born in 2007 when two Hosts welcomed three guests to their San Francisco home. Since then, it has grown to 4 million Hosts who have welcomed more than 1 billion guest arrivals to about 100,000 cities in almost every country and region across the globe.  Hosts on Airbnb are everyday people who share their worlds to provide guests with the feeling of connection and being at home. Airbnb believes that hosts, guests, and the communities where they operate are all stakeholders and Airbnb has a responsibility to serve them and that by serving them alongside our employees and investors, Airbnb will build an enduringly successful company.", "statement": "Airbnb's mission is to Create a world where anyone can belong anywhere.", "values": "The core values at Airbnb are: Champion the MissionWe’re united with our community to create a world where anyone can belong anywhere. Be a HostWe're caring, open, and encouraging to everyone we work with. Embrace the AdventureWe’re driven by curiosity, optimism, and the belief that every person can grow. Be a Cereal EntrepreneurWe’re determined and creative in transforming our bold ambitions into reality.", "offer": []}, {"name": "Amazon", "socials": [["Website", "https://amazon.com/"], ["Twitter", "https://twitter.com/Amazon"], ["LinkedIn", "https://linkedin.com/company/amazon"]], "founded": "1994", "employees": "100K+", "about": "Amazon is an American multinational technology company based in Seattle, Washington, which focuses on e-commerce, cloud computing, digital streaming, and artificial intelligence. It is one of the “Big Five” companies in the U.S. information technology industry, along with Google, Apple, Microsoft, and Facebook. The company has been referred to as \"one of the most influential economic and cultural forces in the world\", as well as the world's most valuable brand.", "statement": "Amazon's mission is to be Earth's most customer-centric company. This is what unites Amazonians across teams and geographies as we are all striving to delight our customers and make their lives easier, one innovative product, service, and idea at a time.", "values": "We use our Leadership Principles every day, whether we're discussing ideas for new projects or deciding on the best approach to solving a problem. It is just one of the things that makes Amazon peculiar. Leaders start with the customer and work backwards. They work vigorously to earn and keep customer trust. Although leaders pay attention to competitors, they obsess over customers. Leaders are owners. They think long term and don’t sacrifice long-term value for short-term results. They act on behalf of the entire company, beyond just their own team. They never say “that’s not my job.\" Leaders expect and require innovation and invention from their teams and always find ways to simplify. They are externally aware, look for new ideas from everywhere, and are not limited by “not invented here.\" As we do new things, we accept that we may be misunderstood for long periods of time. Leaders are right a lot. They have strong judgment and good instincts. They seek diverse perspectives and work to disconfirm their beliefs. Leaders are never done learning and always seek to improve themselves. They are curious about new possibilities and act to explore them. Leaders raise the performance bar with every hire and promotion. They recognize exceptional talent, and willingly move them throughout the organization. Leaders develop leaders and take seriously their role in coaching others. We work on behalf of our people to invent mechanisms for development like Career Choice. Leaders have relentlessly high standards — many people may think these standards are unreasonably high. Leaders are continually raising the bar and drive their teams to deliver high quality products, services, and processes. Leaders ensure that defects do not get sent down the line and that problems are fixed so they stay fixed. Thinking small is a self-fulfilling prophecy. Leaders create and communicate a bold direction that inspires results. They think differently and look around corners for ways to serve customers. Speed matters in business. Many decisions and actions are reversible and do not need extensive study. We value calculated risk taking. Accomplish more with less. Constraints breed resourcefulness, self-sufficiency, and invention. There are no extra points for growing headcount, budget size, or fixed expense. Leaders listen attentively, speak candidly, and treat others respectfully. They are vocally self-critical, even when doing so is awkward or embarrassing. Leaders do not believe their or their team’s body odor smells of perfume. They benchmark themselves and their teams against the best. Leaders operate at all levels, stay connected to the details, audit frequently, and are skeptical when metrics and anecdote differ. No task is beneath them. Leaders are obligated to respectfully challenge decisions when they disagree, even when doing so is uncomfortable or exhausting. Leaders have conviction and are tenacious. They do not compromise for the sake of social cohesion. Once a decision is determined, they commit wholly. Leaders focus on the key inputs for their business and deliver them with the right quality and in a timely fashion. Despite setbacks, they rise to the occasion and never settle. Leaders work every day to create a safer, more productive, higher performing, more diverse, and more just work environment. They lead with empathy, have fun at work, and make it easy for others to have fun. Leaders ask themselves: Are my fellow employees growing? Are they empowered? Are they ready for what's next? Leaders have a vision for and commitment to their employees' personal success, whether that be at Amazon or elsewhere. We started in a garage, but we're not there anymore. We are big, we impact the world, and we are far from perfect. We must be humble and thoughtful about even the secondary effects of our actions. Our local communities, planet, and future generations need us to be better every day. We must begin each day with a determination to make better, do better, and be better for our customers, our employees, our partners, and the world at large. And we must end every day knowing we can do even more tomorrow. Leaders create more than they consume and always leave things better than how they found them.", "offer": [{"category": "Allowances", "benefits": [{"name": "Broadband Reimbursement", "comment": ""}, {"name": "Meal Allowance", "comment": ""}]}, {"category": "Insurance", "benefits": [{"name": "Accident Insurance", "comment": ""}, {"name": "Health Insurance", "comment": ""}]}, {"category": "Leaves", "benefits": [{"name": "Maternity Leave", "comment": ""}, {"name": "Paternity Leave", "comment": ""}, {"name": "Sabbatical", "comment": ""}, {"name": "Sick Leave", "comment": ""}]}, {"category": "Other Benefits", "benefits": [{"name": "Day-Care Support", "comment": ""}, {"name": "Relocation Benefits", "comment": ""}]}]}, {"name": "Amdocs", "socials": [["Website", "https://amdocs.com/"], ["Twitter", "https://twitter.com/Amdocs"], ["LinkedIn", "https://linkedin.com/company/amdocs/"]], "founded": "1982", "employees": "10K+", "about": "Amdocs is a multinational corporation that provides the expertise and global reach to accelerate the industry’s journey to the cloud and improve business operations, driving innovative next-generation digital experiences for the end-user. The company specializes in software and services for communications, media, and financial services providers, and digital", "statement": "", "values": "", "offer": []}, {"name": "AngelList", "socials": [["Website", "https://angellist.com/"], ["Twitter", "https://twitter.com/AngelList"], ["LinkedIn", "https://linkedin.com/company/angellist"]], "founded": "2010", "employees": "201 - 500", "about": "AngelList is the parent company of AngelList Venture, AngelList Talent, and Product Hunt. They have more than 20 unicorns in their portfolio and have supported millions of job-seekers in their search. They have helped makers launch over 100,000 products that will define the future of tech. AngelList champions startups and the people who empower them across the world.", "statement": "The mission of AngelList is to increase the number of successful startups in the world.", "values": "Be Rigorous in Seeking the TruthBy seeking truth from customers and teammates early and often, we develop rigor around ideas, plans, and work products. Move with Urgency by Scoping DownWe don’t choose between speed and quality. We achieve both by focusing on fewer details and getting them exactly right. Empower the Person Closest to a ProblemOur teams support each other and work collaboratively. If opinions diverge, we empower the task owner to make the call. Build a Safe and Trusted Place for our CommunityWe strive to keep AngelList open and inclusive, prioritize the safety and trust of our users, and champion bold, world-changing ideas.", "offer": []}, {"name": "Apna", "socials": [["Website", "https://apna.co/"], ["Twitter", "https://twitter.com/apnahq"], ["LinkedIn", "https://linkedin.com/company/apnahq"]], "founded": "2019", "employees": "201 - 500", "about": "Apna is a professional app for the rising workforce in India. It helps people to get connected with jobs in the blue-collar domain. Founded in 2019, it is India's number one app in that domain. The users can download their app to access various services offered by Apna, whereas the employers can make use of the web platform to post their openings for free. The services offered by Apna for the public include searching for job openings, applying for jobs, scheduling interviews, job alerts & smart filters, learning English, Government exam preparation, and being a part of groups such as Business Group, etc. Holding more than 1.5 Lakh+ employers, Apna hosts crores of interviews online.", "statement": "Apna's mission is to connect people with opportunities.", "values": "", "offer": []}, {"name": "Apple", "socials": [["Website", "https://apple.com/"], ["Twitter", "https://mobile.twitter.com/apple"], ["LinkedIn", "https://linkedin.com/company/apple"]], "founded": "1976", "employees": "10K+", "about": "Apple is an American multinational technology company that specializes in consumer electronics, software, and online services. They offer a wide range of products/services in terms of hardware and software. ", "statement": "Apple's mission is to bring the best user experience to its customers through its innovative hardware, software, and services.", "values": "AccessibilityTechnology is most powerful when everyone can make their mark. EnvironmentOur goal is to leave the planet better than we found it. PrivacyWe design Apple products to protect your privacy and give you control over your information. Supplier ResponsibilityWe believe in a safe, respectful, and supportive workplace for everyone.", "offer": []}, {"name": "Arcesium", "socials": [["Website", "https://arcesium.com/"], ["Twitter", "https://twitter.com/arcesium"], ["LinkedIn", "https://linkedin.com/company/arcesium"]], "founded": "2015", "employees": "1K - 5K", "about": "Arcesium is a global financial technology and professional services firm, delivering solutions to some of the world's most sophisticated financial institutions, including hedge funds, banks, and institutional asset managers.", "statement": "", "values": "Our values capture how our employees act every day to bring the best of Arcesium to each other and our clients. We put the integrity of our products above all else. We innovate to make our products and solutions robust to meet the needs of tomorrow's strategies. We anticipate the risks our clients face and the controls they need, and we make these central to our product. We chart the path forward using our industry-leading expertise and a deep connection to the needs of the most sophisticated market participants. We advance our skills and knowledge daily. Our clients trust us to advise them candidly. We build on a foundation of long term investments in our product, people and culture. We are considerate of the value of time, energy, and capital. We are not afraid to take risks that make commercial sense. We are united by a common ambition that drives our work and actions. We share our knowledge and skills to develop the team, and we expect the best from each other. We recognize that a diverse, inclusive environment rich with learning, debate, and fun is what makes our company (and our product) great.", "offer": [{"category": "Allowances", "benefits": [{"name": "Gym", "comment": ""}, {"name": "Meal Allowance", "comment": ""}, {"name": "Remote Work Allowance", "comment": ""}]}, {"category": "Insurance", "benefits": [{"name": "Accident Insurance", "comment": ""}, {"name": "Health Insurance", "comment": ""}, {"name": "Life Insurance", "comment": ""}]}, {"category": "Leaves", "benefits": [{"name": "Maternity Leave", "comment": ""}, {"name": "Paternity Leave", "comment": ""}, {"name": "Sabbatical", "comment": ""}, {"name": "Sick Leave", "comment": ""}]}, {"category": "Other Benefits", "benefits": [{"name": "Car Lease", "comment": ""}, {"name": "Higher Education Assistance", "comment": ""}, {"name": "Relocation Benefits", "comment": ""}]}]}, {"name": "Atlassian", "socials": [["Website", "https://atlassian.com/"], ["Twitter", "https://twitter.com/atlassian"], ["LinkedIn", "https://linkedin.com/company/atlassian"]], "founded": "2002", "employees": "5K - 10K", "about": "Atlassian Corporation Plc is an Australian software company that develops products for software developers, project managers and other software development teams. Its flagship product is Jira. It also owns the popular Kanban-style project management software Trello.", "statement": "Atlassian's mission is to help unleash the potential of every team.", "values": "These are the values that guide our business, our product development, and our brand. As our company continues to evolve and grow, these five values remain constant. Openness is root level for us. Information is open internally by default and sharing is a first principle. And we understand that speaking your mind requires equal parts brains (what to say), thoughtfulness (when to say it), and caring (how it’s said). “Measure twice, cut once.” Whether you're building a birdhouse or a business, this is good advice. Passion and urgency infuse everything we do, alongside the wisdom to consider options fully and with care. Then we make the cut, and we get to work. Customers are our lifeblood. Without happy customers, we’re doomed. So considering the customer perspective - collectively, not just a handful - comes first. We spend a huge amount of our time at work. So the more that time doesn’t feel like “work,” the better. We can be serious, without taking ourselves too seriously. We strive to put what’s right for the team first – whether in a meeting room or on a football pitch. All Atlassians should have the courage and resourcefulness to spark change – to make better our products, our people, our place. Continuous improvement is a shared responsibility. Action is an independent one.", "offer": []}, {"name": "BankBazaar", "socials": [["Website", "https://bankbazaar.com/"], ["Twitter", "https://twitter.com/bankbazaar"], ["LinkedIn", "https://linkedin.com/company/bank_bazaar"]], "founded": "2008", "employees": "1K - 5K", "about": "BankBazaar is the world’s first neutral online marketplace that helps people compare and choose financial products such as loans, insurance, credit cards, fixed deposits, saving accounts, mutual funds, etc., - over a highly secure, user-friendly, and intuitive platform. BankBazaar focuses on harnessing technology to deliver end-to-end paperless transactions which bring huge convenience to customers while helping support the environment. With a supportive customer service team and a growing community of users, BankBazaar is the easiest way for people to compare and purchase the right financial products online. BankBazaar partners with over 80 financial organizations in India that include the largest nationalized and private banks, NBFCs, and insurance companies to offer a never-before range of financial products and services. Supported by global investors such as Walden International, Sequoia Capital, Fidelity Growth Partners, Mousse Partners, and Amazon, BankBazaar is headquartered in Chennai, India, and has offices in Bangalore and Mumbai.", "statement": "Bank Bazaar's mission is to help customers access the right financial products.", "values": "", "offer": []}, {"name": "Barclays", "socials": [["Website", "https://home.barclays/"], ["Twitter", "https://twitter.com/Barclays"], ["LinkedIn", "https://linkedin.com/company/barclays-bank/"]], "founded": "1690", "employees": "10K+", "about": "Barclays is a British universal bank. We are diversified by business, by different types of customers and clients, and by geography. Our businesses include consumer banking and payments operations around the world, as well as a top-tier, full service, global corporate and investment bank, all of which are supported by our service company which provides technology, operations, and functional services across the Group. With over 325 years of history and expertise in banking, Barclays operates in over 40 countries and employs approximately 83,500 people. Barclays moves, lends, invests, and protects money for customers and clients worldwide. Barclays is a trading name of Barclays Bank PLC and its subsidiaries. Barclays Bank PLC is registered in England and is authorized by the Prudential Regulation Authority and regulated by the Financial Conduct Authority and the Prudential Regulation Authority. Registered in England. Registered No. 1026167. Registered office: 1 Churchill Place, London E14 5HP.", "statement": "", "values": "Our five Values – Respect, Integrity, Service, Excellence, and Stewardship – are our moral compass; the fundamentals of who we are, and what we believe is right. RespectWe harness the power of diversity and inclusion in our business, trust those we work with, and value everyone’s contribution IntegrityWe operate with honesty, transparency, and fairness in all we do ServiceWe act with empathy and humility, putting the people and businesses we serve at the centre of what we do ExcellenceWe champion innovation, and use our energy, expertise and resources to make a positive difference StewardshipWe prize sustainability, and are passionate about leaving things better than we found them", "offer": []}, {"name": "BharatPe", "socials": [["Website", "https://bharatpe.com/"], ["Twitter", "https://twitter.com/bharatpeindia"], ["LinkedIn", "https://linkedin.com/company/bharatpe"]], "founded": "2018", "employees": "1K - 2.5K", "about": "BharatPe is India's leading merchant payment company. It helps merchants accept payments from customers for free. It also offers fintech products like loans. It is a full-stack service app for merchants across small and medium businesses, offering loans, investments, insurance, and other financial services. BharatPe was co-founded by Ashneer Grover and Shashvat Nakrani in 2018 with the vision to make financial inclusion a reality for Indian merchants.", "statement": "The mission of BharatPe is to make financial inclusion a reality for Indian merchants.", "values": "", "offer": []}, {"name": "BigBasket", "socials": [["Website", "https://bigbasket.com/"], ["Twitter", "https://twitter.com/bigbasket_com"], ["LinkedIn", "https://linkedin.com/company/bigbasket-com/"]], "founded": "2011", "employees": "10K+", "about": "BigBasket is India’s largest online food and grocery store. With over 18,000 products and over 1000 brands in their catalog, you will find everything you are looking for. Right from fresh Fruits and Vegetables, Rice and Dals, Spices and Seasonings to Packaged products, Beverages, Personal care products, Meats, BigBasket has everything available. In this fast-paced world, BigBasket wants to make your grocery shopping easy and convenient so that no time is wasted in this process. BigBasket is owned by Tata Digital since 2021.", "statement": "", "values": "The four core values at BigBasket are:Transparency Integrity Humility Respect for People", "offer": []}, {"name": "blinkit [Grofers]", "socials": [["Website", "https://blinkit.in/"], ["Twitter", "https://twitter.com/letsblinkit"], ["LinkedIn", "https://linkedin.com/company/grofers/"]], "founded": "2013", "employees": "10K - 5K", "about": "Blinkit is India's #1 instant commerce platform. We pioneered the 10-minute delivery model in India and intend to take it across the country by the end of 2022. Over 10 million Indians shop on Blinkit for everything from grocery staples and vegetables to emergency supplies and electronics. Blinkit currently delivers over 1,00,000 orders every day and is aimed at bringing the future of commerce to everyone in India.", "statement": "", "values": "", "offer": []}, {"name": "BNY Mellon", "socials": [["Website", "https://bnymellon.com/"], ["Twitter", "https://twitter.com/bnymellon"], ["LinkedIn", "https://linkedin.com/company/bny-mellon"]], "founded": "1784", "employees": "0 - 10K", "about": "BNY Mellon is a global investments company dedicated to helping its clients manage and service their financial assets throughout the investment lifecycle. Whether providing financial services for institutions, corporations, or individual investors, BNY Mellon delivers informed investment and wealth management and investment services in 35 countries. As of Dec 31, 2021, BNY Mellon had $46.7 trillion in assets under custody and/or administration, and $2.4 trillion in assets under management. BNY Mellon can act as a single point of contact for clients looking to create, trade, hold, manage, service, distribute or restructure investments. BNY Mellon is the corporate brand of The Bank of New York Mellon Corporation.", "statement": "", "values": "The values at BNY Mellon are: Passion for ExcellenceWe get it done. We strive to be extraordinary. IntegrityWe do what is right, always. We challenge each other – even when it’s uncomfortable. Strength in DiversityWe seek out who is missing and help everyone feel included. We invest in each other’s success. Courage to LeadWe take the risks necessary to lead.  We grow and move on from failures.", "offer": []}, {"name": "BrowserStack", "socials": [["Website", "https://browserstack.com/"], ["Twitter", "https://twitter.com/browserstack"], ["LinkedIn", "https://linkedin.com/company/browserstack"]], "founded": "2011", "employees": "501 - 1K", "about": "BrowserStack is the world’s leading software testing platform powering over two million tests every day across 15 global data centers. They help Microsoft, Twitter, Barclays, Expedia, and over 25,000 customers deliver quality software at speed by moving testing to our Cloud. BrowserStack's platform provides instant access to 3,000+ real mobile devices and browsers on a highly reliable cloud infrastructure that effortlessly scales as testing needs grow. With BrowserStack, Dev and QA teams can move fast while delivering an amazing experience for every customer. Founded in 2011, BrowserStack is a privately held company backed by Accel with offices in San Francisco, Mumbai, and Dublin.", "statement": "BrowserStack’s mission is to empower developers to build amazing experiences.", "values": "", "offer": []}, {"name": "CARS24", "socials": [["Website", "https://cars24.com/"], ["Twitter", "https://twitter.com/cars24india"], ["LinkedIn", "https://linkedin.com/company/cars24/"]], "founded": "2015", "employees": "1K - 5K", "about": "CARS24 is a tech-first organization looking to make inroads into the global auto-tech market in groundbreaking ways. They have taken a splintered used-vehicle market and turned it into a streamlined tech-driven one, with intuitive discovery mechanisms, collaborations with partners at the micro and macro levels, and constant innovation. The next-gen approach to the pre-owned automobile industry is offered at CARS24. On the surface, CARS24 is a cutting-edge e-commerce platform, making the purchase and sale of used vehicles as easy as any other online transaction. Delving deeper, they are a global force in the auto industry, with connections to channel partners, auto dealers, refurbishers, garages, and auto experts in every country that they have a presence.", "statement": "The mission of CARS24 is:", "values": "The core values at CARS24 are: OwnershipWe don’t want our employees to be managed, but to take control Investing In Employees And PartnersWe don’t look forward to raising capital but, to raise our people and partners High Standards And High ResultsWe don’t settle for less, instead, we focus on more MeritocracyWe won’t let exceptional performance go unrewarded; our aspirations are bigger than they appear TrustWe won’t get successful until there is a strong and deep trust with each and every stakeholder FrugalityWe don’t try to be penny wise, pound foolish but we won’t spend when it doesn’t ‘add value’ Long TermIn our minds, we got to be clear that doing the best work of our lives will be a very long journey", "offer": []}, {"name": "Cisco", "socials": [["Website", "https://cisco.com/"], ["Twitter", "https://twitter.com/cisco_in"], ["LinkedIn", "https://linkedin.com/company/cisco"]], "founded": "1984", "employees": "10K+", "about": "Cisco enables people to make powerful connections- whether in business, education, philanthropy, or creativity. Cisco hardware, software, and service offerings are used to create the Internet solutions that make networks possible--providing easy access to information anywhere, at any time. Since the company's inception, Cisco engineers have been leaders in the development of Internet Protocol (IP)-based networking technologies. Today, with more than 71,000 employees worldwide, this tradition of innovation continues with industry-leading products and solutions in the company's core development areas of routing and switching, as well as in advanced technologies such as home networking, IP telephony, optical networking, security, storage area networking, and wireless technology. In addition to its products, Cisco provides a broad range of service offerings, including technical support and advanced services. Cisco sells its products and services, both directly through its own sales force as well as through its channel partners, to large enterprises, commercial businesses, service providers, and consumers.", "statement": "VisionCisco's vision is aimed at changing the way we work, live, play, and learn.  MissionCisco's mission is to shape the future of the Internet by creating unprecedented value and opportunity for our customers, employees, investors, and ecosystem partners.", "values": "", "offer": []}, {"name": "Citrix", "socials": [["Website", "https://citrix.com/"], ["Twitter", "https://twitter.com/citrix"], ["LinkedIn", "https://linkedin.com/company/citrix/"]], "founded": "1989", "employees": "5K - 10K", "about": "Citrix is an American multinational cloud computing and virtualization technology company. Citrix provides technology that empowers organizations to unlock potential & deliver a better employee experience. Their goal is to give people the space to succeed & do their best work - wherever they are. They provide server, application and desktop virtualization, networking, software as a service, and cloud computing technologies.", "statement": "The vision of Citrix is to create a world where people can experience work and life in harmony. ", "values": "IntegrityWe act with honesty and hold each other accountable. RespectWe are open, inclusive and empathetic. CuriosityWe are continuously innovating, learning and improving. CourageWe dream big and we are bold, passionate and selfless in pursuit of those dreams. UnityWe collaborate to win together.", "offer": []}, {"name": "ClearTax", "socials": [["Website", "https://cleartax.in/"], ["Twitter", "https://twitter.com/cleartax_in"], ["LinkedIn", "https://linkedin.com/company/cleartaxindia/"]], "founded": "2011", "employees": "251 - 1K", "about": "Cleartax is a fintech company helping individuals, tax practitioners and businesses do tax filings. For individuals, Cleartax offers IT returns filing, mutual fund investments and expert assisted services. For tax professionals, Cleartax offers comprehensive GST, ITR and TDS filing solutions. For small and large businesses, Cleartax's product suite covers GST, e-Waybill, e-Invoicing and a range of ClearTax managed services. Cleartax was incubated in Y Combinator and is funded by Silicon Valley investors, including PayPal co-founders Peter Theil's Founders Fund, Max Levchin and Scott Banister - an early investor in Facebook and Uber.", "statement": "Cleartax's mission is to simplify finances, save money and time for millions of Indian businesses and people.", "values": "We want to build products that our customers love. Our teams obsess about the customers right from the start and keep iterating on the basis of feedback. Our customer’s trust is the keystone to our business and we strive to earn it each day. It is their trust that motivates us to push the envelope and do better. Our mission is bold, so our dreams need to be big too. Even when we tackle small tasks, we do it because they unlock bigger things. We believe in extreme ownership demonstrated by committing to the problem, wearing multiple hats, fixing what is broken and sometimes doing the untold. After each problem you solve, raise the ambition for the next one. Practice extraordinary commitment to the problem and raise the bar for others.", "offer": [{"category": "Insurance", "benefits": [{"name": "Health Insurance", "comment": ""}, {"name": "Life Insurance", "comment": ""}]}, {"category": "Leaves", "benefits": [{"name": "Maternity Leave", "comment": ""}, {"name": "Paternity Leave", "comment": ""}, {"name": "Sick Leave", "comment": ""}]}, {"category": "Other Benefits", "benefits": [{"name": "Higher Education Assistance", "comment": ""}]}]}, {"name": "Cohesity", "socials": [["Website", "https://cohesity.com/"], ["Twitter", "https://twitter.com/cohesity"], ["LinkedIn", "https://linkedin.com/company/cohesity/"]], "founded": "2013", "employees": "1K - 5K", "about": "Cohesity is an American company that develops software that allows IT professionals to backup, manage, and gain insights from their data, across multiple systems or cloud providers.", "statement": "Cohesity's mission is to radically simplify how organizations manage their data and unlock limitless value.", "values": "The core values (RADIO) at Cohesity are: RespectWe treat everyone with dignity, compassion, and fairness. Positive AttitudeWe embrace change and tackle resistance with energy and enthusiasm. DeliverWe focus on outcomes, not activity. And we expect the incredible from our teams. IntegrityWe have an unwavering commitment to doing the right thing, even when no one is looking. Customer ObsessionWe put our customers at the center of everything we do.", "offer": []}, {"name": "CoinSwitch Kuber", "socials": [["Website", "https://coinswitch.co/"], ["Twitter", "https://twitter.com/CoinSwitchKuber"], ["LinkedIn", "https://linkedin.com/company/coinswitch"]], "founded": "2017", "employees": "201 - 500", "about": "CoinSwitch Kuber is a secure, user-friendly crypto trading platform for users in India, where they can buy 80+ cryptocurrencies like Bitcoin, Ethereum, Ripple, etc easily, at the best rate, with a variety of payment options being offered. The users can access the pooled liquidity of the leading cryptocurrency exchanges in India to get the best rate and trade instantaneously, after completing the KYC/AML procedures. CoinSwitch Kuber app is the best cryptocurrency exchange for Indians as it provides them a seamless user experience, through a simplistic user interface.", "statement": "At CoinSwitch Kuber, we believe in financial inclusion - that wealth, investment, and financial knowledge are for everyone. Our Mission, therefore, is to challenge the status quo. We believe that our platform democratises cryptocurrency investment so the everyday man can make his money work for him - without a fancy degree or a boatload of money.", "values": "There are values on which CoinSwitch Kuber base themselves to deliver the best and actualize our mission to make a meaningful difference in people’s livesCustomer First Approach Ownership Disagree & commit Every day is DAY 1 Think Big & Fail Fast Data-driven", "offer": []}, {"name": "Coinbase", "socials": [["Website", "https://coinbase.com/"], ["Twitter", "https://twitter.com/coinbase"], ["LinkedIn", "https://linkedin.com/company/coinbase"]], "founded": "2012", "employees": "2.5K - 5K", "about": "Coinbase is an American company that operates a cryptocurrency exchange platform. Coinbase operates remote-first and is a secure platform that makes it easy to buy, sell, and store cryptocurrencies like Bitcoin, Ethereum, and more. They offer a trusted and easy-to-use platform for accessing the broader cryptoeconomy.", "statement": "Our mission is to increase economic freedom in the world Everyone deserves access to financial services that can help empower them to create a better life for themselves and their families. If the world economy ran on a common set of standards that could not be manipulated by any company or country, the world would be a more fair and free place, and human progress would accelerate.", "values": "We are direct and succinct. We share information efficiently, improving collaboration and productivity. We practice active listening. We have a bias for action. We complete high-quality work quickly. We focus on the 20% of work that will get us 80% of the impact. We take 100% responsibility for achieving the mission. We seek to improve all aspects of our company even in ways that are not explicitly part of our job. We are a winning team, not a family, and have high expectations for performance and delivering results. We're stronger together so we choose to focus on what unites us, and not on what divides us. We have an intense work culture and are regularly pushed out of our comfort zones. We take rest seriously, to improve productivity over the long term. Coinbase should continually earn employees' commitment and, likewise, expects employees to earn their seats at the company. We are deeply focused on solving our customers' problems with technology, by enabling them to acquire, store and use crypto. We strive to be the easiest to use, most trusted, and most secure platform. In every decision we make, we ask, \"How does this create more value for our customers?\" We are builders, leveraging technology to improve the world, constantly shipping ideas vs. just discussing them. We know that companies must continually reinvent themselves to avoid stagnation. We have a high tolerance for failure, investing 10% of our resources in venture bets that are uncomfortably ambitious. We are optimistic about the future and determined to get there. We co-create solutions instead of choosing blame and criticism. We create moments of play at work. ", "offer": []}, {"name": "CRED", "socials": [["Website", "https://cred.club/"], ["Twitter", "https://twitter.com/CRED_club"], ["LinkedIn", "https://linkedin.com/company/credapp"]], "founded": "2018", "employees": "100 - 1K", "about": "CRED is a members-only club that rewards individuals for their timely credit card bill payments by providing them with exclusive offers and access to premium experiences. It is a platform that allows credit card users to manage multiple cards along with an analysis of their credit score. ", "statement": "", "values": "", "offer": []}, {"name": "Cricbuzz", "socials": [["Website", "https://cricbuzz.com/"], ["Twitter", "https://twitter.com/cricbuzz"], ["LinkedIn", "https://linkedin.com/company/cricbuzz.com"]], "founded": "2004", "employees": "51 - 200", "about": "Owned by the Times Internet group, Cricbuzz is an Indian cricket news website that features news, articles and live coverage of cricket matches happening across the world. The platform includes videos, text commentary, player stats, and team rankings. Cricbuzz offers these services through their website as well as through the mobile application for the Android and iOS platforms. ", "statement": "", "values": "", "offer": []}, {"name": "CultFit", "socials": [["Website", "https://cult.fit/"], ["Twitter", "https://twitter.com/cultfitOfficial"], ["LinkedIn", "https://linkedin.com/company/cult.fit"]], "founded": "2016", "employees": "1K - 5K", "about": "cult.fit (formerly cure.fit or Curefit) is a health and fitness company offering digital and offline experiences across fitness, nutrition, and mental well-being. With the aim to make fitness fun and easy, cult.fit gives workouts a whole new meaning with a range of trainer-led, group workout classes. It makes workouts fun, daily food is healthy and tasty, mental fitness easy with yoga and meditation, and medical and lifestyle care hassle-free. Co-founded by Mukesh Bansal and Ankit in Nagori 2016, the company is headquartered in Bangalore, Karnataka.", "statement": "cult.fit's mission is to “make health easy”. Through our products and services, we want to enable people to significantly improve their overall health, reduce the risk of lifestyle diseases and enable a long, disease free life.", "values": "", "offer": []}, {"name": "D. E. Shaw", "socials": [["Website", "https://deshaw.com/"], ["Twitter", "https://twitter.com/deshawgroup"], ["LinkedIn", "https://linkedin.com/company/d.-e.-shaw-&-co./"]], "founded": "1988", "employees": "1K - 5K", "about": "D. E. Shaw group is a pioneer in computational finance. The firm has more than 1900 people around the globe and an institutional-grade (and trip-proof) infrastructure. The D. E. Shaw group is trusted by investors across the world to manage their assets by seeking the optimal balance of risk and reward. While they're known as a pioneer in quantitative investing, they also have considerable expertise in areas that involve fundamental analysis or portfolio manager discretion. D. E. Shaw group uses a combination of quantitative and qualitative tools to uncover independent, hard-to-find sources of a return across global public and private markets.", "statement": "D. E. Shaw believes in supporting organizations, competitions, and conferences that are educating the next generation of leaders and working to make finance and technology more inclusive.", "values": "At the firm’s foundation are five core principles that define our values and guide our decisions. These concepts are part of D. E. Shaw group's DNA.Hire and Cultivate Extraordinary People Take the High Road Set Unusually Ambitious Goals Focus on the Firm as a Whole Analyze Rigorously and Communicate Clearly", "offer": []}, {"name": "Delhivery", "socials": [["Website", "https://delhivery.com/"], ["Twitter", "https://twitter.com/delhivery"], ["LinkedIn", "https://linkedin.com/company/delhivery/"]], "founded": "2011", "employees": "10K+", "about": "Delhivery is the largest and fastest-growing fully-integrated player in India by revenue in Fiscal 2021. They aim to build the operating system for commerce, through a combination of world-class infrastructure, logistics operations of the highest quality, and cutting-edge engineering and technology capabilities. Since its inception, Delhivery's team has successfully fulfilled over 1 billion orders across India. They have built a nationwide network with a presence in every state, servicing over 17000 pin codes. 21 automated sort centers, 86 gateways, 80+ fulfillment centers, and a team of over 66000 people make it possible for us to deliver 24 hours a day, 7 days a week, 365 days a year.", "statement": "MissionDelhivery's mission is to enable customers to operate flexible, reliable, and resilient supply chains at the lowest costs. VisionWe aim to build the operating system for commerce, through a combination of world-class infrastructure, logistics operations of the highest quality, and cutting-edge engineering and technology capabilities.", "values": "", "offer": []}, {"name": "Digit Insurance", "socials": [["Website", "https://godigit.com/"], ["Twitter", "https://twitter.com/heydigit"], ["LinkedIn", "https://linkedin.com/company/godigit/"]], "founded": "2016", "employees": "1K - 5K", "about": "Digit is a digital insurance company that is aimed at making the insurance process simple for people. It was started in 2016 and is India's first unicorn of 2021. Digit offers insurance solutions across verticals such as health, travel, businesses, vehicles, etc. Digit aims to simplify insurance products so that even a 15-year-old can comprehend them.", "statement": "Digit's mission is To Make Insurance Simple.", "values": "The core values at Digit are: Question the status quoWe believe true innovation happens when we question the way things are done. Be transparentWe believe true innovation happens when we question the way things are done.", "offer": []}, {"name": "Directi", "socials": [["Website", "https://directi.com/"], ["Twitter", "https://twitter.com/Directi"], ["LinkedIn", "https://linkedin.com/company/directi/"]], "founded": "1998", "employees": "1K - 5K", "about": "Directi comprises a group of tech businesses owned, operated, or invested in by Bhavin Turakhia and/or Divyank Turakhia. The Group brand is used by multiple business units that are run independently by their respective management teams, with similar cultures and opportunities. The Directi portfolio companies comprise Radix, Ringo, Flock, Zeta, and Codechef. Media.net, owned by Starbuster TMT Investments, leverages the Directi brand and culture for recruitment in its India offices.  Across these businesses, Directi employs 1600+ people across 8 offices, with over millions of customers and a group enterprise value of over $1.4 Billion. The company has invested in multiple category-leading global brands across business areas as diverse as web presence (domains, hosting, cloud-infrastructure), communication & collaboration (voice and messaging), payments (benefits and compensation), and online advertising.", "statement": "", "values": "", "offer": []}, {"name": "Disney Streaming", "socials": [["Website", "https://dmedmedia.disney.com/"], ["Twitter", "https://twitter.com/DisneyStreaming"], ["LinkedIn", "https://linkedin.com/company/disney-streaming"]], "founded": "2020", "employees": "1K - 5K", "about": "Disney Streaming is a business unit within Disney Media and Entertainment Distribution (DMED), managing operations of The Walt Disney Company's streaming services including Disney+, Hulu, ESPN+ and STAR+.", "statement": "", "values": "", "offer": []}, {"name": "Dream Sports", "socials": [["Website", "https://dreamsports.group/"], ["Twitter", "https://twitter.com/dreamsportshq"], ["LinkedIn", "https://linkedin.com/company/dreamsports"]], "founded": "2008", "employees": "501 - 1K", "about": "Dream Sports is India’s leading sports technology company with brands such as Dream11, world’s largest fantasy sports platform, FanCode, a premier digital sports platform that personalizes content and commerce for all sports fans, DreamX, a sports accelerator, DreamSetGo, a sports experiences platform, and DreamPay, a payment solutions provider. It has founded the Dream Sports Foundation to help and champion sportspeople and is an active member of the Federation of Indian Fantasy Sports, the nodal body for the Fantasy Sports industry in India. Founded in 2008 by Harsh Jain and Bhavit Sheth, Dream Sports is always working on its mission to ‘Make Sports Better’ and is located in Mumbai. Dream Sports has been featured in the Top 10 ‘Great Places to Work’ in India every year since 2018, by the Great Place to Work Institute, in the mid-sized company category.", "statement": "", "values": "", "offer": []}, {"name": "Dukaan", "socials": [["Website", "https://mydukaan.io/"], ["Twitter", "https://twitter.com/mydukaanapp"], ["LinkedIn", "https://linkedin.com/company/dukaan"]], "founded": "2020", "employees": "51 - 200", "about": "Dukaan is a DIY platform that enables merchants with zero programming skills to set up their e-commerce store using smartphones. Dukaan app was created with the aim to support and help local businesses that were facing a crisis during the raging pandemic. Within a year, Dukaan has evolved into a platform for businesses of any size, volume, and geographical location and provides multiple business features to simplify the e-commerce lifecycle.  ", "statement": "", "values": "", "offer": []}, {"name": "Dunzo", "socials": [["Website", "https://dunzo.com/"], ["Twitter", "https://twitter.com/dunzoit"], ["LinkedIn", "https://linkedin.com/company/dunzo-in/"]], "founded": "2015", "employees": "1K - 5K", "about": "Dunzo is an all-in-one 24X7 delivery platform, that picks and delivers anything and everything within the city while guaranteeing super-quick deliveries. Dunzo offers services that include the delivery of packages, groceries, food, medicines, pet supplies, and more. Founded and headquartered in Bengaluru, Dunzo was incorporated in 2015. Dunzo started as a Whatsapp group and has consistently proved its mettle as a convenience app and has grown from strength to strength. Dunzo is now fully operational in 8 cities.", "statement": "", "values": "Customer FirstWe deliver a 5-star experience for users, partners and merchants on every order. Be DependableWe do what we say. On time, every time. Dunzo SpeedWe ship fast and often. 100 - 100Every team member is entirely responsible for the final outcome. Do More with LessWe get things done with efficient use of time, capital and people. In Data we TrustWe test, measure, learn, repeat. Radically HonestWe challenge openly and directly, but only attack the idea, never the person. CelebrateWe celebrate our wins - generously and together.", "offer": []}, {"name": "Expedia", "socials": [["Website", "https://expediagroup.com/"], ["Twitter", "https://twitter.com/Expedia"], ["LinkedIn", "https://linkedin.com/company/expedia"]], "founded": "1996", "employees": "10K+", "about": "Expedia Group powers travel for everyone, everywhere through our global platform. Driven by the core belief that travel is a force for good, Expedia helps people experience the world in new ways and build lasting connections. They provide industry-leading technology solutions to fuel partner growth and success while facilitating memorable experiences for travelers. Expedia hosts a lot of services including Trivago to help improve the user experience. Powered by more than 70+ terabytes of data and 20+ years of tech innovation, Expedia Group is one of the world’s largest travel platforms. With unrivaled knowledge of the industry and advanced tech innovation, Expedia has built a two-sided marketplace that allows them to filter through millions of different possibilities, for travelers and partners worldwide.", "statement": "Expedia's mission is to power global travel for everyone, everywhere.", "values": "Choose FearlesslyOwn your own decisions. Make mistakes. Move on. Begin again. Force SimplicityDrive clarity and create momentum. Focus on impactful work.  Include ConsciouslyBring people in. Drive success for everyone around you. Seek out diverse ideas and experiences to unlock better outcomes for our travelers and our company Trust Each OtherWe challenge each other and then place our trust in each other to deliver. Go Get What's NextWe're always hungry for a better future and we have big dreams- for ourselves, for the company, and for the possibilities opened up by travel. ", "offer": []}, {"name": "FamPay", "socials": [["Website", "https://fampay.in/"], ["Twitter", "https://twitter.com/fampayindia"], ["LinkedIn", "https://in.linkedin.com/company/fampay"]], "founded": "2019", "employees": "11 - 50", "about": "FamPay is raising a new, financially aware generation of Indians who understand the fundamentals of personal finance and are capable of making decisions in their best long-term interest. FamPay is a marketing and distribution partner of IDFC FIRST Bank Prepaid Card.", "statement": "We are raising a new, financially aware generation of Indians who understand the fundamentals of personal finance and are capable of making decisions in their best long-term interest.", "values": "Must have vs Good to have This helps in prioritizing the work right, building the most important things and keeping the pace up. We over me, always We strongly believe in the power of team. Individually we are a drop, and together we are an ocean. User is the King That's our thought process for decision making. Always think about the user first. Do whatever it takes Nothing should stop the execution. Don't stop when you are tired, stop when you are done.", "offer": []}, {"name": "Fi", "socials": [["Website", "https://fi.money/"], ["Twitter", "https://twitter.com/Bank_on_Fi"], ["LinkedIn", "https://linkedin.com/company/epifi/"]], "founded": "2019", "employees": "201 - 500", "about": "Fi is a neobank a.k.a online banking platform, that attempts to re-imagine the banking experience in India. The Fi account, in partnership with Federal Bank, is a digital bank account that gives you the fastest way to open a bank account online. The users can do everything from the Fi App, including p2p payments, fund transfers, bill payments, and more, with features to automate every action. You also get a Fi Debit card, spends insights, and tools to grow your investment and earn rewards.  ", "statement": "", "values": "", "offer": []}, {"name": "Flipkart", "socials": [["Website", "https://flipkart.com/"], ["Twitter", "https://twitter.com/Flipkart"], ["LinkedIn", "https://linkedin.com/company/flipkart"]], "founded": "2007", "employees": "10K - 50K", "about": "The Flipkart Group is one of India’s leading digital commerce entities and includes group companies Flipkart, Myntra, and Jabong. Launched in 2007, Flipkart has enabled millions of consumers, sellers, merchants and small businesses to be a part of India’s e-commerce revolution. With a registered customer base of over 100 million, offering over 80 million products across 80+ categories, Flipkart is known for pioneering services such as Cash on Delivery, No Cost EMI and easy returns – customer-centric innovations that have made online shopping more accessible and affordable for millions of Indians. Together with Myntra and Jabong, which hold prominent positions in the online fashion market, the Flipkart Group has steered the transformation of commerce in India through technology.", "statement": "", "values": "While we adapt, evolve, and continue to grow, the beliefs that are most important to us stay the same - Audacity, Bias for Action, and Customer First - our core values which are reflected in everything we do! While these core values define our identity and form the basis of all our decisions and actions, integrity and inclusion underpins all our processes.", "offer": [{"category": "Allowances", "benefits": [{"name": "Broadband Reimbursement", "comment": "Reimbursement upto 1000/month"}, {"name": "Gym", "comment": "Onsite Gym"}, {"name": "Meal Allowance", "comment": "2200/month from salary (Tax benefit)"}, {"name": "Mobile Reimbursement", "comment": "For select divisions. 500-1500/month"}]}, {"category": "Insurance", "benefits": [{"name": "Accident Insurance", "comment": "5 times of Annual CTC"}, {"name": "Health Insurance", "comment": "No waiting period. Dependents covered."}, {"name": "Life Insurance", "comment": "5 times of Annual CTC"}]}, {"category": "Leaves", "benefits": [{"name": "Maternity Leave", "comment": "6 months leave and 4 months of flexible hours"}, {"name": "Paternity Leave", "comment": "15 days"}, {"name": "Sabbatical", "comment": "After 2 years at Flipkart"}, {"name": "Sick Leave", "comment": "12 days"}]}, {"category": "Other Benefits", "benefits": [{"name": "Car Lease", "comment": "Max of 20% of base salary"}, {"name": "Higher Education Assistance", "comment": "Full-time/Part-time/Sabbatical"}, {"name": "Relocation Benefits", "comment": "Self + 5 family members"}]}]}, {"name": "Flock", "socials": [["Website", "https://flock.com/"], ["Twitter", "https://twitter.com/flock"], ["LinkedIn", "https://linkedin.com/company/flockapp"]], "founded": "2014", "employees": "51 - 200", "about": "Flock is a Communication and Collaboration App designed specifically for Teams looking for a faster and more efficient way to communicate. You can discuss projects, share ideas, and make decisions faster! Flock integrates with other leading apps making sure all your work efforts are unified. Flock powers over 35,000 companies globally. Flock users around the world have reported increased productivity by 30%, 50% fewer emails, and 50% reduced in-person meetings. Our clientele includes teams at Accenture, Tim Hortons, Whirlpool, VMware, and Victorinox.", "statement": "", "values": "", "offer": []}, {"name": "FreeCharge", "socials": [["Website", "https://freecharge.in/"], ["Twitter", "https://twitter.com/freecharge"], ["LinkedIn", "https://linkedin.com/company/freecharge-in/"]], "founded": "2010", "employees": "501 - 1K", "about": "FreeCharge, a wholly-owned subsidiary of Axis Bank Limited, is India’s No.1 payments app. Customers across the country use FreeCharge to make prepaid, postpaid, DTH, metro recharge, and utility bill payments for numerous service providers. FreeCharge launched its wallet in September 2015 and customers are already using it to pay across all major online platforms and offline stores like Shoppers Stop, McDonald's, Cinepolis, HomeStop, Crosswords, Hypercity, and even for E-Rickshaws, the list is growing by the day. FreeCharge is on a mission to get millions of merchants both in the organized and unorganized sectors to be a part of the digital payments ecosystem. Their Chat-n-Pay service is all about social payments. It is an engaging and secure way for you to seamlessly Chat-n-Pay to friends, family, and merchants in less than 5 seconds. It also enables merchants, small or large to accept digital payments in less than 1 minute after registering on the FreeCharge App.", "statement": "The mission of FreeCharge is to get millions of merchants both in the organized and unorganized sectors to be a part of the digital payments ecosystem.", "values": "", "offer": []}, {"name": "GitHub", "socials": [["Website", "https://github.com/about"], ["Twitter", "https://twitter.com/github"], ["LinkedIn", "https://linkedin.com/company/github/"]], "founded": "2008", "employees": "501 - 1K", "about": "GitHub is a platform to share code with friends, co-workers, classmates, and complete strangers. Over 70 million people use GitHub to build amazing things together. With all the collaborative features of GitHub, it makes it easier for individuals and teams to write faster, better code. GitHub also allows users to host websites on the platforms as well as offers a suite of features that will help people deploy various applications.  GitHub also supports open-source projects/developers with various initiatives, students with communities, and a lot more. GitHub is currently the most used code hosting and collaboration tool with more than 73 million users, 4 million companies including 84% of Fortune 100 companies, and in total hosting more than 200 million repositories.", "statement": "GitHub’s mission is to help every developer - regardless of experience level - learn, code, and ship software effectively.", "values": "", "offer": []}, {"name": "Glance", "socials": [["Website", "https://glance.com/"], ["Twitter", "https://twitter.com/glancescreen"], ["LinkedIn", "https://linkedin.com/company/glancescreen"]], "founded": "2019", "employees": "501 - 1K", "about": "Glance is a software company that delivers personalized content to the lock screens of smartphones. Glance is one of India’s largest lock screen platforms in India and Southeast Asia, enabling consumers to experience the internet on the lock screens of their smartphones. Glance's AI-powered personalization enables consumers to enjoy content, products, and services of their choice, all delivered in an intuitive and visually attractive format.  Funded by Google and Mithril Partners, Glance is an unconsolidated subsidiary of InMobi and has over 150 million daily active users in India, and an estimated 25 million in Southeast Asia.", "statement": "", "values": "", "offer": []}, {"name": "Gojek", "socials": [["Website", "https://gojek.com/"], ["LinkedIn", "https://linkedin.com/company/gojek/"]], "founded": "", "employees": "", "about": "Gojek is a Super App. It’s one app for ordering food, commuting, digital payments, shopping, hyper-local delivery, and a dozen other products. It is Indonesia’s first and only decacorn. It's also the only Southeast Asian startup to be part of Fortune's list of 'Companies That Changed The World.'", "statement": "Gojek is dedicated to creating and scaling up positive socio-economic impact on the ecosystem of users, driver-partners, business and micro-small-medium enterprise partners, as well as service providers.", "values": "", "offer": []}, {"name": "Goldman Sachs", "socials": [["Website", "https://goldmansachs.com/"], ["Twitter", "https://twitter.com/GoldmanSachs"], ["LinkedIn", "https://linkedin.com/company/goldman-sachs/"]], "founded": "1869", "employees": "10K+", "about": "The Goldman Sachs Group, Inc. is a leading global financial institution that delivers a broad range of financial services across investment banking, securities, investment management, and consumer banking to a large and diversified client base that includes corporations, financial institutions, governments, and individuals. Founded in 1869, the firm is headquartered in New York and maintains offices in all major financial centers around the world.", "statement": "", "values": "Client ServiceWe lead with a service mindset, enabling us to anticipate and adapt to the needs of our clients and consumers by delivering thoughtful, innovative solutions. ExcellenceWe aspire to nothing less than excellence, consistently striving for exceptional performance and achieving outstanding results for our clients, our shareholders, and our company. IntegrityWe hold ourselves accountable to the highest ethical standards, insisting on transparency and vigilance from our people as we learn from our experiences and make decisions that instill a sense of purpose and pride in our firm. PartnershipWe prioritize collaboration and value diversity, creating a culture that fosters inclusiveness, teamwork and an entrepreneurial mindset in the pursuit of professional and personal excellence.", "offer": []}, {"name": "Google", "socials": [["Website", "https://about.google/"], ["Twitter", "https://twitter.com/google"], ["LinkedIn", "https://linkedin.com/company/google"]], "founded": "1998", "employees": "10K+", "about": "Google is an American multinational technology company that specializes in Internet-related services and products. Their products/services include online advertising technologies, a search engine, cloud computing, software, and hardware. Their products are used by billions of customers across the world. ", "statement": "Google's mission is to organise the world’s information and make it universally accessible and useful.", "values": "Here are the Ten things of Google.Focus on the user and all else will follow It’s best to do one thing really, really well Fast is better than slow Democracy on the web works You don’t need to be at your desk to need an answer You can make money without doing evil There’s always more information out there The need for information crosses all borders You can be serious without a suit Great just isn’t good enough", "offer": []}, {"name": "Grab", "socials": [["Website", "https://grab.com/"], ["Twitter", "https://twitter.com/grabsg"], ["LinkedIn", "https://linkedin.com/company/grabapp"]], "founded": "", "employees": "10K+", "about": "Grab is Southeast Asia’s leading super app, offering a suite of services consisting of deliveries, mobility, financial services, enterprise, and others. They offer a wide range of services for consumers, merchants, and enterprises. Grab delivers food, groceries, and acts as an express connecting everything to the doorstep of users.  Grab also have financial services which include a payment platform for secure and seamless cashless payments, Insurance and Investment Services, etc. Grab is one of the fastest-growing and most innovative company across the world. ", "statement": "VisionGrab's vision is to Drive Southeast Asia Forward. MissionGrab aims to drive Southeast Asia forward by delivering on three missions. They are:", "values": "At Grab, every Grabber is guided by The Grab Way, which explains the mission and the operating principles on how they achieve it together. HeartWe work together as OneGrab to serve communities in Southeast Asia HungerWe work to understand ground truths and drive improvements, big and small HonourWe keep our word and steward our resources wisely to build and sustain trust HumilityWe are a constant work-in-progress, and we never stop learning to get better", "offer": []}, {"name": "Groupon", "socials": [["Website", "https://groupon.com/"], ["Twitter", "https://twitter.com/Groupon"], ["LinkedIn", "https://linkedin.com/company/groupon/"]], "founded": "2008", "employees": "5K - 10K", "about": "Groupon provides a global marketplace where people can buy just about anything, anywhere, anytime. They are enabling real-time commerce across an expanding range of categories including local businesses, travel destinations, consumer products, and live or lively events. At the same time, Groupon is providing advertising options and tools that merchants can use to grow and manage their businesses. Groupon believes that great people make great companies and that starting with the customer and working backward moves them forward.", "statement": "Groupon's mission is To be the destination for experiences -- where customers discover fun things to do and local businesses thrive.", "values": "The values at Groupon are:Respect, Integrity, and Inclusion - Solving Problems The Right Way, Together Community - Build Local Everywhere Ownership and Performance - Act Like It’s Your Business Inspiration - Make Work Less Boring Customers - Begin and End with the Customer", "offer": []}, {"name": "Groww", "socials": [["Website", "https://groww.in/"], ["Twitter", "https://twitter.com/_groww"], ["LinkedIn", "https://linkedin.com/company/groww.in"]], "founded": "2016", "employees": "501 - 1K", "about": "Groww is a Demat & stock trading app that allows you to open a free Demat account & trade BSE, NSE listed stocks in the share market at a low brokerage on the stock orders. It has enabled millions of Indians by providing them with an easier option for managing their finances. Groww helps users make their investment process easy, fast and transparent.", "statement": "Groww is on a mission to democratize access to financial services for millions of Indians responsibly.", "values": "Customers FirstEvery decision we make is centered around our customer’s needs and convenience. Simple is BeautifulBe it our app, website, or services - we strive to keep making things simpler. Honesty & IntegrityWe want our customers to be completely aware of everything to do with their investments. Whatever we do is always crystal clear.", "offer": []}, {"name": "Gupshup", "socials": [["Website", "https://gupshup.io/"], ["Twitter", "https://twitter.com/gupshup"], ["LinkedIn", "https://linkedin.com/company/gupshup/"]], "founded": "2004", "employees": "501 - 1K", "about": "Gupshup enables better customer engagement through conversational messaging. Gupshup is the leading conversational messaging platform, powering over 6 billion messages per month. Across verticals, thousands of large and small businesses in emerging markets use Gupshup to build conversational experiences across marketing, sales, and support. Gupshup’s carrier-grade platform provides a single messaging API for 30+ channels, a rich conversational experience-building tool kit for any use case, and a network of emerging market partnerships across messaging channels, device manufacturers, ISVs, and operators. With Gupshup, businesses have made conversations an integral part of their customer engagement success.", "statement": "Gupshup's mission is to build the tools that help businesses better engage customers through mobile messaging and conversational experiences.", "values": "", "offer": []}, {"name": "HackerRank", "socials": [["Website", "https://hackerrank.com/"], ["Twitter", "https://twitter.com/home"], ["LinkedIn", "https://linkedin.com/company/hackerrank/"]], "founded": "2012", "employees": "501 - 1K", "about": "HackerRank is a technology hiring platform that is the standard for assessing developer skills for over 2600 companies around the world. HackerRank helps companies hire skilled developers and innovate faster by enabling tech recruiters and hiring managers to objectively evaluate talent at every stage of the recruiting process. HackerRank is the leader of technical skill assessments for developers. Every 8 seconds, someone around the world will complete one of our assessments. With over 170M data points on technical skill assessments and 16M developers in our community, HackerRank is poised to transform the way developers are matched to jobs.", "statement": "Accelerate the World's Innovation", "values": "Data Driven Extreme Ownership Customer Delight GiverWe are not afraid to challenge the status-quo We debate respectfully and insightfully as often as we can We never stop learning We operate in a ‘no excuse’ zone We are relentlessly resourceful We are obsessed with customer happiness We sweat the details in every interaction We optimize for speed We are direct, but not mean We make time to help others achieve their goals We seek to understand", "offer": []}, {"name": "Happay", "socials": [["Website", "https://happay.com/"], ["Twitter", "https://twitter.com/LiveHappay"], ["LinkedIn", "https://linkedin.com/company/va-tech-ventures-happay-/"]], "founded": "2012", "employees": "201 - 500", "about": "Happay is Asia's Most Favoured Travel & Expense Management Platform. Having worked with 6,500+ clients across 40+ verticals, Happay manages the corporate's 100% Business spending and payments on a single platform. Happay is among one of the few fintech companies in the world, which has a deep integration between the payment & technology stack, thus enabling them to leverage new technologies and strive for innovation.", "statement": "", "values": "", "offer": []}, {"name": "Hashnode", "socials": [["Website", "https://hashnode.com/"], ["Twitter", "https://twitter.com/hashnode"], ["LinkedIn", "https://linkedin.com/company/hashnode"]], "founded": "2016", "employees": "51 - 200", "about": "Hashnode is a free content creation platform that enables developers to create a full-fledged & optimized blog mapped to their custom domain for free.", "statement": "Connect world's developers and help them share knowledge easily and grow.", "values": "", "offer": []}, {"name": "HealthifyMe", "socials": [["Website", "https://healthifyme.com/"], ["Twitter", "https://twitter.com/healthifyme"], ["LinkedIn", "https://linkedin.com/company/healthifyme/"]], "founded": "2012", "employees": "1K - 2K", "about": "HealthifyMe is a revolutionary health and fitness application that is on a mission to transform a billion lives! HealthifyMe is changing how people stay fit, eat clean, and build a lasting healthy lifestyle. With over 20 million+ downloads, 800+ nutrition, fitness, and yoga coaches, HealthifyMe has made a prominent presence in South East Asia and is looking to conquer the global market. The power of Artificial Intelligence, supported by Human Intelligence, brings together a product that is transforming lives! HealthifyMe has a B2B wing, tying up with over 100 companies across the country to deliver employee wellness solutions.", "statement": "HealthifyMe's mission is to healthify a billion lives.", "values": "The values at HealthifyMe are:Mission First Act Like an Owner Do The Impossible Customer Focused Do The Right Thing High Standards", "offer": []}, {"name": "Hike", "socials": [["Website", "https://hike.in/"], ["Twitter", "https://twitter.com/Team_Hike"], ["LinkedIn", "https://linkedin.com/company/hike/"]], "founded": "", "employees": "201 - 500", "about": "Hike is building a new social future at the intersection of Social, Gaming & Crypto. The internet is in the middle of a significant transformation. Fuelled by the advancements in technology & Web3, users can partake in the growth, and success of products & communities they belong to, from the very beginning. Hike is building products for this next decade that is going to spawn a whole new social future. Hike’s latest round of funding came in August 2021, where they raised capital from the world’s best product innovators & investors.", "statement": "", "values": "The eight core values at Hike are:Top Talent in Every Role → Both a quest for greatness & shared values are important to us Pro-Sports Team → Strength-based, results driven with a \"team-first\" attitude Customer at the Centre → We exist to delight our customers Constant Innovation → Courage to walk into the unknown and pioneer new fronts We are Owners → Proactive & radically responsible. Everyone is an owner  Thoughtful Decision Making → Clear mind, obsession to simplify & data-informed  Bias for Action → Ruthless prioritization & move fast  Be Open-minded & Keep Learning → Curiosity to acquire new perspectives, quickly  Think Big & Win → Courage to climb big mountains ", "offer": []}, {"name": "Hotstar", "socials": [["Website", "https://hotstar.com/"], ["Twitter", "https://twitter.com/DisneyPlusHS"], ["LinkedIn", "https://linkedin.com/company/hotstar-com/"]], "founded": "2015", "employees": "501 - 1K", "about": "Disney+ Hotstar is an online video streaming platform owned by Novi Digital Entertainment Private Limited, a wholly-owned subsidiary of Star India Private Limited. Disney+ Hotstar currently offers over 100,000 hours of TV content and movies across 9 languages, and every major sport covered live. Highly evolved video streaming technology and high attention to the quality of experience across devices and platforms, make Disney+ Hotstar the most complete video destination for Over The Top (OTT) video consumers.", "statement": "", "values": "", "offer": []}, {"name": "HSBC", "socials": [["Website", "https://hsbc.com/"], ["Twitter", "https://twitter.com/HSBC_IN"], ["LinkedIn", "https://linkedin.com/company/hsbc/"]], "founded": "1865", "employees": "10K+", "about": "HSBC is a financial services organization that serves more than 40 million customers, ranging from individual savers and investors to some of the world’s biggest companies and governments. Their network covers 64 countries and territories. HSBC's unique expertise, capabilities, breadth, and perspectives open up a world of opportunity for their customers.", "statement": "HSBC's purpose: Opening up a world of opportunity", "values": "The core values at HSBC are: We value differenceSeeking out different perspectives We succeed togetherCollaborating across boundaries We take responsibilityHolding ourselves accountable and taking the long view We get it doneMoving at pace and making things happen", "offer": []}, {"name": "InMobi", "socials": [["Website", "https://inmobi.com/"], ["Twitter", "https://twitter.com/InMobi"], ["LinkedIn", "https://linkedin.com/company/inmobi/"]], "founded": "2007", "employees": "1K - 5K", "about": "InMobi is the world's leading Marketing Cloud, driving real connections between brands and consumers. They create new paths for brands to understand, identify, engage and acquire consumers by leveraging our exclusive access to mobile intelligence and technology platforms. As a leading technology company founded in 2007, InMobi has been recognized as a 2019 CNBC Disruptor 50 company and as Fast Company's 2018 Most Innovative Companies. InMobi offers products both for advertisers as well as for publishers. They also offer monetization tools for mobile apps, websites, and games. Apart from these, technology and products for growth are also offered as a part of the InMobi suite. InMobi is also the parent organization of Glance and Roposo. ", "statement": "MissionInMobi's mission is to drive real connections between brands and consumers. VisionThe idea of InMobi is born with a vision to change the way advertisements are seen on mobile devices.", "values": "", "offer": []}, {"name": "Innovaccer", "socials": [["Website", "https://innovaccer.com/"], ["Twitter", "https://twitter.com/innovaccer"], ["LinkedIn", "https://linkedin.com/company/innovaccer/"]], "founded": "2014", "employees": "1K - 5K", "about": "Innovaccer is a leading healthcare data activation platform company focused on delivering more efficient and effective healthcare through the use of pioneering analytics and transparent, clean, and accurate data. Innvoaccer’s aim is to simplify complex data from all points of care, streamline the information, and help organizations make powerful decisions and realize strategic goals based on key insights and predictions from their data. Its products have been deployed across more than 500 locations with over 10,000 providers leveraging it at institutions, governmental organizations, and several corporate enterprises such as Mercy ACO, StratiFi Health, Catalyst Health Network, Osler Health Network, and PHIX HIE. Innovaccer is based in San Francisco with offices around the United States and Asia.", "statement": "Our mission is to connect and curate the world’s healthcare information to make it accessible and useful. With Innovaccer, everyone works in the service of patients like never before—as one. ", "values": "", "offer": []}, {"name": "Intuit", "socials": [["Website", "https://intuit.com/"], ["Twitter", "https://twitter.com/Intuit"], ["LinkedIn", "https://linkedin.com/company/intuit"]], "founded": "1983", "employees": "5K - 10K", "about": "Intuit is an American global technology platform that helps our customers and communities overcome their most important financial challenges. Intuit serves millions of customers worldwide with TurboTax, QuickBooks, Mint, Credit Karma, and Mailchimp. ", "statement": "Intuit's mission is to power prosperity around the world is why we show up to work every single day to do incredible things for our customers", "values": "These values honor our history and how we started, and guide us in delivering on our mission of powering prosperity around the world. Our values underpin a culture that attracts the world’s top talent. We empower employees to bring their whole selves to work and to do the best work of their lives. Going the extra mile—and then some—is in our DNA.Integrity Without Compromise Customer Obsession Stronger Together We Care And Give Back Courage", "offer": []}, {"name": "ixigo", "socials": [["Website", "https://ixigo.com/"], ["Twitter", "https://twitter.com/ixigo"], ["LinkedIn", "https://linkedin.com/company/ixigo"]], "founded": "2007", "employees": "201 - 500", "about": "Launched in 2007, ixigo is a technology company focused on empowering Indian travellers to plan, book, and manage their trips across rail, air, buses, and hotels. ixigo assists travellers in making smarter travel decisions by leveraging artificial intelligence, machine learning, and data science led innovations on their OTA platforms, comprising of websites and mobile applications.  ixigo's vision is to become the most customer-centric travel company, by offering the best customer experience to the users. ixigo's focus on travel utility and customer experience for travellers in the 'next billion users' segment is driven by technology, cost-efficiency, and their culture of innovation that has made them India's leading travel ecosystem for the next billion users.", "statement": "ixigo's vision is to become the most customer-centric travel company", "values": "", "offer": []}, {"name": "JPMorgan Chase & Co.", "socials": [["Website", "https://jpmorganchase.com/"], ["Twitter", "https://twitter.com/jpmorgan"], ["LinkedIn", "https://in.linkedin.com/company/jpmorganchase"]], "founded": "2000", "employees": "10K+", "about": "JPMorgan Chase & Co. is an American multinational investment bank and financial services holding company headquartered in New York City.", "statement": "", "values": "", "offer": []}, {"name": "Jumbotail", "socials": [["Website", "https://jumbotail.com/"], ["Twitter", "https://twitter.com/jumbotail"], ["LinkedIn", "https://linkedin.com/company/jumbotail/"]], "founded": "2015", "employees": "201 - 500", "about": "Jumbotail is India's leading B2B marketplace and New Retail platform, serving thousands of mom & pop stores (“Kiranas”). Jumbotail ecosystem has 4 in-house, proprietary platforms - B2B online marketplace, Supply Chain & Logistics, Fintech for SME Lending, and Retail platform that powers its J24 branded convenience grocery stores. Jumbotail transforms traditional unorganized Kirana stores into J24 branded modern convenience grocery stores, owned and operated by Kirana entrepreneurs, powered by Jumbotail's New Retail platform and playbook consisting of J24 consumer branding, in-store GoldenEye retail technology, data-driven product selection and merchandising insights, integrated supply chain with daily store fulfilments, Greencard loyalty program and payment solutions.", "statement": "The vision of Jumbotail is to organize the food and grocery ecosystem in India using technology, data science, and design.", "values": "These are the core values of Jumbotail Read more about the core values of Jumbotail here.Customer fanatics Think long term; focus on impact Bias for action Pursue excellence Always hungry for more Take Ownership Take risks; fail fast, fail safe Exercise judgment Debate, decide, deliver; disagree and commit Share knowledge Open, honest, and direct Integrity of thought, purpose, and action Empathy Humility Build and lead happy teams", "offer": []}, {"name": "Jumio", "socials": [["Website", "https://jumio.com/"], ["Twitter", "https://twitter.com/jumio"], ["LinkedIn", "https://linkedin.com/company/jumio-corporation"]], "founded": "2010", "employees": "501 - 1K", "about": "Jumio is a B2B technology company dedicated to eradicating online identity fraud, money laundering, and other financial crimes to help make the internet safer. Jumio uses informed AI and machine learning to create solutions that are trusted by leading brands worldwide and respected by industry thought leaders. The Jumio KYX Platform offers a range of identity proofing and AML services to accurately establish, maintain and reassert trust from account opening to ongoing transaction monitoring. Leveraging advanced technology including AI, biometrics, machine learning, liveness detection, and automation, Jumio helps organizations fight fraud and financial crime, onboard good customers faster, and meet regulatory compliance including KYC, AML, and GDPR. Jumio has verified more than 300 million identities issued by over 200 countries and territories from the real-time web and mobile transactions. Jumio’s solutions are used by leading companies in the financial services, sharing economy, digital currency, retail, travel, and online gaming sectors.", "statement": "Jumio’s mission is to make the internet a safer place by protecting the ecosystems of businesses through unified, end-to-end identity verification and eKYC platform", "values": "Here are the core values at Jumio: Ideal Integrity  Diversity Empowerment Accountability  Leading Innovation ", "offer": []}, {"name": "Juspay", "socials": [["Website", "https://juspay.in/"], ["Twitter", "https://twitter.com/juspay"], ["LinkedIn", "https://linkedin.com/company/juspay-technologies"]], "founded": "2012", "employees": "501 - 1K", "about": "Juspay is a leading fintech company in India and their SDKs are installed on over 200Mn devices, and process over 5Mn transactions every day. Juspay counts Amazon, Ola, Vodafone, Jio, etc among their customers. With 8 years running and US$27Mn in funding, Juspay is in this for the long haul. Juspay’s vision is to enable frictionless payments for the billion Indians. Their products include India’s most used 2FA Auth SDK, an end-to-end Payments Stack, and various Checkout APIs. Juspay's team also helped shape UPI and crafted the BHIM App 1.0 which processes over INR 5-Billion monthly.", "statement": "Juspay’s vision is to enable frictionless payments for the billion Indians.  ", "values": "The core values at Juspay are: Maximize Value CreationCreate value from nothing. Do more with less. Do the right thing. Enable People for 10xHelp people develop their true potential. Develop a depth-seeking culture. Take Big, Courageous Moves..in the right direction. Don’t be afraid of the unknown. De-risk & take big jumps. Code + Design Building BlocksBuild solid, lasting frameworks in both - code & ux. Digital wave has just begun! Unify: Bring Order to ChaosThink up from first principles. Codify. Integrate. Abstract out. Do basics. Focus. Open Up & Break Stale RigidityBe curious about adjacent possibles. Adopt a ‘Play’ mindset & challenge assumptions. Harmonize..chaos and Order. Be striving towards the greater good. Balance ideal and practical.", "offer": []}, {"name": "Khatabook", "socials": [["Website", "https://khatabook.com/"], ["Twitter", "https://twitter.com/Khatabook"], ["LinkedIn", "https://in.linkedin.com/company/khatabook"]], "founded": "2018", "employees": "201 - 500", "about": "Founded in January 2019, Khatabook is the world's fastest-growing Saas company. It has become India's leading business management app for MSMEs with 13 languages & 50M+ downloads in a remarkably short period of time. Founded by four IIT-Bombay grads, Khatabook is led by Ravish Naresh, Co-founder, and COO at Housing.com, one of India’s most significant property listing websites. Khatabook enables micro, small and medium merchants to track business transactions safely and securely. It also offers features such as online payment collection through UPI and QR; sending periodic reminders to creditors via messages and report generation. Today, Khatabook has become a household name. Merchants are using the app extensively while adding $200 Million worth of transactions every day. The high engagement has resulted in more than 25% of the total active merchants joining the platform through word-of-mouth and referrals. Khatabook's users recovered billions stuck in credit in six months, significantly impacting India’s MSME sector.", "statement": "Khatabook's mission is to Simplify business, empower merchants.", "values": "", "offer": []}, {"name": "LeapFinance", "socials": [["Website", "https://leapfinance.com/"], ["Twitter", "https://twitter.com/leapfinancein"], ["LinkedIn", "https://linkedin.com/company/leapfinance"]], "founded": "2019", "employees": "201 - 500", "about": "Leap Finance is a Fin-tech (and Ed-tech) startup based in India that offers education loans and credit cards to Indian students studying overseas. They create modern financial products and services that help Indian students pursue a global career, from choosing the right university and the best financing option to lining up job interviews and introductions. The first offering of LeapFinance is a Graduate student loan, designed specifically for Indian students.", "statement": "Increase global opportunities for Indian students", "values": "", "offer": []}, {"name": "LinkedIn", "socials": [["Website", "https://linkedin.com/"], ["Twitter", "https://twitter.com/linkedin"], ["LinkedIn", "https://linkedin.com/company/linkedin/"]], "founded": "2003", "employees": "10K+", "about": "Founded in 2003, LinkedIn connects the world's professionals to make them more productive and successful. With more than 800 million members worldwide, including executives from every Fortune 500 company, LinkedIn is the world's largest professional network. The company has a diversified business model with revenue coming from Talent Solutions, Marketing Solutions, Sales Solutions, and Premium Subscriptions products. Headquartered in Silicon Valley, LinkedIn has offices across the globe. In December 2016, Microsoft completed its acquisition of LinkedIn, bringing together the world’s leading professional cloud and the world’s leading professional network.", "statement": "Mission The mission of LinkedIn is simple: connect the world’s professionals to make them more productive and successful. Vision Create economic opportunity for every member of the global workforce.", "values": "", "offer": []}, {"name": "MakeMyTrip ", "socials": [["Website", "https://makemytrip.com/"], ["Twitter", "https://twitter.com/makemytrip/"], ["LinkedIn", "https://linkedin.com/company/makemytrip.com/"]], "founded": "2000", "employees": "1K - 5K", "about": "MakeMyTrip is India’s one-stop travel shop that is transforming how Indians travel. Powered by technology, MMT is helping India go places with its wide array of products and services through its powerful portfolio of brands MakeMyTrip, Goibibo, and RedBus, catering to the needs of all Indian travelers. From cabs, buses, trains, flights to hotels, homestays, holiday packages, and more, MMT is catering to the ever-evolving needs of travelers across the spectrum. MakeMyTrip's almost two-decade-long journey is shaped by the vision and entrepreneurial spirit of every ‘Go-Tripper’ who strives to make the experience of every traveler convenient, seamless, and distinctive. MMT is the home to some of the best travel ideas – and its growth is a testimony of their team’s passion and dedication to providing the widest range of choices and the finest travel solutions to customers.", "statement": "At GO-MMT, our vision is to make travel simple and fun for all, and our core values guide us in making this possible. These core values can be seen in the projects that we undertake, and the way in which we solve problems for our customers. They are a representation of OUR BEING & OUR DOING. Each member of the GO-MMT family is guided by them, each and every day.", "values": "The state of existing, the most important part of a person’s mind or self. The act of making something happen through action.Curious: I am inquisitive, I ask questions to absorb, reflect and solve . I strive to learn & understand how my work is connected to others. I am flexible and open to ideas. Creative: I am inventive. I bring fresh perspective, I am experimental, I create new options and possibilities. Caring: I am genuine & helpful, I support & empathise, I nurture and invest in relationships, I collaborate & co-create. Customer Focus: We use customer lens proactively to anticipate and understand customer expectations. We keep customer in the center of our deliberations, decisions and debates to champion their interest. Commitment to Results: We take the highest level of ownership and accountability for every task at hand. We achieve superior results and execute well even in the face of all odds. Continuous Improvement: We make ongoing efforts to enhance our products, services and processes. We believe that incremental changes are the cornerstones of breakthrough innovations.", "offer": []}, {"name": "Mastercard", "socials": [["Website", "https://mastercard.co.in/"], ["Twitter", "https://twitter.com/mastercardnews"], ["LinkedIn", "https://linkedin.com/company/mastercard/"]], "founded": "1966", "employees": "10K+", "about": "Mastercard is a global technology company in the payments industry. Their mission is to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart, and accessible. Using secure data and networks, partnerships, and passion, Mastercard's innovations and solutions help individuals, financial institutions, governments, and businesses realize their greatest potential. With connections across more than 210 countries and territories, Mastercard is building a sustainable world that unlocks priceless possibilities for all.", "statement": "Mastercard's mission is to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart, and accessible.", "values": "", "offer": []}, {"name": "Media.net", "socials": [["Website", "https://media.net/"], ["LinkedIn", "https://linkedin.com/company/media.net/"]], "founded": "2010", "employees": "1K - 5K", "about": "Media.net is a leading global advertising company with one of the most comprehensive portfolios of advertising technology in the industry across search, native, display, mobile, local, products, and video. Media.net manages high-quality ad supply on over 500,000 websites and its platform and products are licensed by some of the largest publishers, ad networks, and other ad tech companies worldwide. By market cap, Media.net is one of the Top 5 largest ad tech companies worldwide. By revenue, Media.net is the second-largest contextual advertising business worldwide.", "statement": "", "values": "", "offer": []}, {"name": "Meesho", "socials": [["Website", "https://meesho.com/"], ["Twitter", "https://twitter.com/Meesho_Official"], ["LinkedIn", "https://linkedin.com/company/meesho"]], "founded": "2015", "employees": "1K - 5K", "about": "Meesho is India’s fastest-growing internet commerce company aiming to make eCommerce accessible to everyone. Meesho's vision is to enable 100 million small businesses in India, including individual entrepreneurs, to succeed online. Meesho is democratizing internet commerce by bringing a range of products and new customers online. What started, six years ago, as a reseller-focused platform enabling millions to sell online, has now emerged as a single ecosystem connecting sellers to consumers and entrepreneurs.", "statement": "Mission Democratize internet commerce for everyone Vision Enable 100M small businesses in India to succeed online", "values": "", "offer": []}, {"name": "Meta", "socials": [["Website", "https://meta.com/"], ["Twitter", "https://twitter.com/Meta"], ["LinkedIn", "https://linkedin.com/company/meta/"]], "founded": "2004", "employees": "10K+", "about": "Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram, and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology.", "statement": "MissionBring people together. VisionHelp bring the metaverse to life.", "values": "The core values at Meta are: Be BoldBuilding great things means taking risks. We have a saying: 'The riskiest thing is to take no risks.' In a world that's changing quickly, you're guaranteed to fail if you don't take any risks. Focus on ImpactTo make the most impact, we need to solve the most important problems. We expect Facebook employees to avoid wasting time on minor issues and focus on truly big challenges. Move FastWe believe that it’s better to move fast and make mistakes than to move slowly and miss opportunities. Doing so enables us to build more things and learn faster. Be OpenInformed people make better decisions and make a greater impact — so we work hard to ensure that everyone at Facebook can access as much information about the company as possible. Build Social ValueAt Facebook, we’re trying to bring the world closer together — not just grow our business. Our people focus on creating real value for the world — every day and in everything they do.", "offer": []}, {"name": "Microsoft", "socials": [["Website", "https://microsoft.com/"], ["Twitter", "https://twitter.com/Microsoft"], ["LinkedIn", "https://linkedin.com/company/microsoft"]], "founded": "1975", "employees": "100K+", "about": "Microsoft Corporation is an American multinational technology company with headquarters in Redmond, Washington. It develops, manufactures, licenses, supports, and sells computer software, consumer electronics, personal computers, and related services. Its best known software products are the Microsoft Windows line of operating systems, the Microsoft Office suite, and the Internet Explorer and Edge web browsers.", "statement": "Microsoft's mission is to empower every person and every organization on the planet to achieve more.", "values": "Microsoft's values:Citizenship Trustworthy Computing Innovation Diversity and Inclusion Environment", "offer": [{"category": "Allowances", "benefits": [{"name": "Broadband Reimbursement", "comment": "Tax benefit"}, {"name": "Gym", "comment": "Onsite Gym + Fitness Reimbursement"}, {"name": "Meal Allowance", "comment": "Onsite Free Food"}, {"name": "Mobile Reimbursement", "comment": "For select divisions"}, {"name": "Remote Work Allowance", "comment": ""}]}, {"category": "Insurance", "benefits": [{"name": "Accident Insurance", "comment": "2 times of Base Salary"}, {"name": "Health Insurance", "comment": "Includes Dental, Vision and OPD"}, {"name": "Life Insurance", "comment": "2 times of Base Salary"}]}, {"category": "Leaves", "benefits": [{"name": "Maternity Leave", "comment": "26 weeks"}, {"name": "Paternity Leave", "comment": "6 weeks"}, {"name": "Sabbatical", "comment": ""}, {"name": "Sick Leave", "comment": "12 days"}]}, {"category": "Other Benefits", "benefits": [{"name": "Adoption Assistance", "comment": "26 weeks for female employees. 6 weeks for male employees."}, {"name": "Car Lease", "comment": ""}, {"name": "Day-Care Support", "comment": ""}, {"name": "Higher Education Assistance", "comment": ""}, {"name": "Relocation Benefits", "comment": ""}]}]}, {"name": "Mindtickle", "socials": [["Website", "https://mindtickle.com/"], ["Twitter", "https://twitter.com/mindtickle"], ["LinkedIn", "https://linkedin.com/company/mindtickle"]], "founded": "2012", "employees": "501 - 1K", "about": "Mindtickle is the market-leading sales readiness platform, helping revenue leaders at world-class companies like Johnson & Johnson, Splunk, and Wipro, be ready to grow revenue by increasing knowledge, understanding ideal sales behaviors, and adapting to change. Dozens of Fortune 500 and Forbes Global 2000 companies use Mindtickle to define excellence, build knowledge, align content, analyze performance, and optimize behavior throughout their sales organizations. Mindtickle is recognized as a market leader by top industry analysts and is ranked by G2 as both the #1 enterprise software product and #5 sales software product.", "statement": "", "values": "Here are the values of Mindtickle: Delight our customersWe are customer success fanatics and often exceed their expectations in every possible way Act like foundersWe do what is in the best interest for our company and not just individuals/teams Better togetherWe respect our teammates, enjoy our friendships, express our opinions candidly, work together for a common goal and help one another achieve it", "offer": []}, {"name": "MongoDB", "socials": [["Website", "https://mongodb.com/"], ["Twitter", "https://twitter.com/mongodb"], ["LinkedIn", "https://linkedin.com/company/mongodbinc/"]], "founded": "2007", "employees": "1K - 5K", "about": "MongoDB is the leading modern, general-purpose database platform, designed to unleash the power of software and data for developers and the applications they build. Headquartered in New York, MongoDB has more than 31,000 customers in over 100 countries. The MongoDB database platform has been downloaded over 210 million times and there have been more than 1.5 million registrations for MongoDB University courses. The MongoDB community is transforming industries and empowering developers to build amazing apps that people use every day. MongoDB is a leading modern data platform and the first database provider to go public in 20 years.", "statement": "MongoDB's mission is to Free the genius within everyone.", "values": "Think Big, Go FarWe are big dreamers with a passion for creativity. We eagerly pursue new opportunities and markets through innovation and disruption. We have a pioneering spirit - always ready to forge new paths and take smart risks. Make It MatterWe are relentless in our pursuit of meaningful impact. We think strategically and are clear on what we are and are not trying to do. We accomplish an amazing amount of important work, and we are obsessed with follow through. The team at MongoDB is guided by these core values: Build TogetherWe achieve amazing things by connecting and leveraging the diversity of skills, experiences and backgrounds of our entire organization. We discuss things thoroughly, but prioritize commitment over consensus. We are good listeners and always communicate with clarity and respect. We create and support a positive, inclusive, and accepting environment. Embrace the Power of DifferenceWe commit to creating a culture of inclusion by seeking and valuing employees from different backgrounds and circumstances. We learn from and respect each other’s differences. We firmly believe that a diverse workforce is the best way to broaden our perspectives, foster innovation, and enable a sustainable competitive advantage Be Intellectually HonestWe embrace reality. We apply high-quality thinking and rigor. We have courage in our convictions but work hard to ensure biases or personal beliefs do not get in the way of finding the best solution. Own What You DoWe all play a part in making MongoDB a great place to work. We demand excellence from ourselves, taking ownership and accountability for everything that we do. We empower others around us, just as we are empowered to make change and progress happen.", "offer": []}, {"name": "Morgan Stanley", "socials": [["Website", "https://morganstanley.com/"], ["Twitter", "https://twitter.com/MorganStanley"], ["LinkedIn", "https://linkedin.com/company/morgan-stanley"]], "founded": "1935", "employees": "10K+", "about": "Morgan Stanley is an American multinational investment bank that mobilizes capital to help governments, corporations, institutions, and individuals around the world achieve their financial goals. Morgan Stanley is a consistent industry leader in modern finance which continues to break new ground in advising, serving, and providing new opportunities for its clients. Morgan Stanley is committed to maintaining the first-class service and high standard of excellence that have always defined the firm, which has more than 60,000 employees in 1,200 offices across 41 countries.", "statement": "", "values": "Everything we do at Morgan Stanley is guided by the five core values: Do the right thing Put clients first  Lead with exceptional ideas  Commit to diversity and inclusion Give back", "offer": []}, {"name": "Mobile Premier League", "socials": [["Website", "https://mpl.live/"], ["Twitter", "https://twitter.com/PlayMPL"], ["LinkedIn", "https://linkedin.com/company/mobile-premier-league"]], "founded": "2018", "employees": "1K - 5K", "about": "Mobile Premier League (MPL), is India’s largest eSports and mobile gaming platform, with over 70+ games on its app on iOS and Android. MPL has also expanded to Indonesia and the US and is growing exponentially, with over 90 million users across the globe! MPL is headquartered in Bengaluru, with offices in Pune, Singapore, and Jakarta. Mobile Premier League is backed by marquee investors such as Sequoia Capital, SIG, MDI, Moore Strategic Ventures, Composite Capital, Times Internet, Go-Ventures, Base Partners, etc, and is currently valued at $2.3 billion.", "statement": "The mission of MPL is to become a one-stop shop platform for gamers and game developers.", "values": "", "offer": []}, {"name": "Myntra", "socials": [["Website", "https://myntra.com/"], ["Twitter", "https://twitter.com/myntra"], ["LinkedIn", "https://linkedin.com/company/myntra/"]], "founded": "2007", "employees": "5K - 10K", "about": "Myntra is India’s leading e-commerce company committed to making fashion and lifestyle products accessible to everyone. Myntra aims at providing a hassle-free and enjoyable shopping experience to shoppers across the country with the widest range of brands and products on its portal. They create solutions that disrupt the ordinary and help make the world a happier, more fashionable place. From its beginnings as a customization company in 2007 to being Myntra has evolved to be the technology and fashion pioneers today.", "statement": "Use technology to democratise fashion & lifestyle and help people look good.", "values": "Myntra's value proposition revolves around giving consumers the power and ease of purchasing fashion and lifestyle products online.", "offer": []}, {"name": "Navi", "socials": [["Website", "https://navi.com/"], ["LinkedIn", "https://linkedin.com/company/go-navi/"]], "founded": "2018", "employees": "501 - 1K", "about": "", "statement": "At Navi, our mission is to build financial services that are simple, affordable and accessible.", "values": "", "offer": []}, {"name": "NoBroker", "socials": [["Website", "https://nobroker.in/"], ["Twitter", "https://twitter.com/nobrokercom"], ["LinkedIn", "https://linkedin.com/company/nobroker-in/"]], "founded": "2014", "employees": "1K - 5K", "about": "NoBroker is India's first Proptech unicorn that offers a brokerage-free property search portal that connects house/property owners & tenants/buyers directly by eliminating the middleman. NoBroker removes the information asymmetry that existed in the Indian marketplace and instead creates an environment for a free exchange of information that earlier brokerage.NoBroker is a team of 2000 people driven by the passion to help you fulfill your real estate requirements, without any brokerage. NoBroker has worked tirelessly to remove all information asymmetry caused by brokers. We also enable owners & tenants to interact with each other directly by using our technologically advanced platform.", "statement": "", "values": "", "offer": []}, {"name": "Notion", "socials": [["Website", "https://notion.so/"], ["Twitter", "https://twitter.com/NotionHQ"], ["LinkedIn", "https://linkedin.com/company/notionhq/"]], "founded": "2016", "employees": "201 - 500", "about": "Notion is a project management and note-taking software. Notion is a software designed to help members of a company or organization coordinate deadlines, objectives, and assignments for the sake of efficiency and productivity. It can be used as an all-in-one note-taking app. It offers a lot of features such as integrating third-party tools and hosting the pages as web pages.", "statement": "Notions's mission is to make that a ubiquitous reality.", "values": "The core values of Notion are: Be an owner of the missionWe’re driven by our commitment to empower every person on the planet to use software exactly the way they want. Be a pace setterWe move with urgency so we can set the cadence for our market, cover more ground, and ship more great products and programs for our users, faster. Be a truth seekerWe pursue the best data, ideas, and solutions with rigor and open-mindedness, always guided by our users’ most pressing needs. Be kind and directWe deliver feedback in the spirit of helping our colleagues improve, balancing sensitivity with caring honesty. We’re in this together.", "offer": []}, {"name": "Nutanix", "socials": [["Website", "https://nutanix.com/"], ["Twitter", "https://twitter.com/nutanix"], ["LinkedIn", "https://linkedin.com/company/nutanix"]], "founded": "2009", "employees": "5K - 10K", "about": "Nutanix is an American cloud software company and a pioneer in hyper-converged infrastructure solutions, making clouds invisible, freeing customers to focus on their business outcomes. Organizations around the world use Nutanix software to leverage a single platform to manage any app at any location for their hybrid multi-cloud environments.", "statement": "Mission Make managing IT infrastructure so simple that it becomes invisible.", "values": "", "offer": []}, {"name": "NVIDIA", "socials": [["Website", "https://nvidia.com/"], ["Twitter", "https://twitter.com/nvidia"], ["LinkedIn", "https://linkedin.com/company/nvidia/"]], "founded": "1993", "employees": "10K+", "about": "NVIDIA is an American multinational technology company. It designs graphics processing units (GPUs) for the gaming and professional markets, as well as system on chip units for the mobile computing and automotive market. NVIDIA pioneered accelerated computing to tackle challenges ordinary computers cannot. The breakthroughs they making at NVIDIA across different verticals are impacting businesses everywhere, helping them work faster, better, and smarter.  Scientists, researchers, developers, and creators are using NVIDIA to do amazing things. More than 2.5 million developers and 8,500 startups create thousands of applications for accelerated computing. They have shipped more than a billion CUDA®-based GPUs.", "statement": "", "values": "NVIDIA's core values are: InnovationDream big, start small. Take risks, learn fast. Intellectual Honesty Seek truth, learn from mistakes, share learnings.  Speed and AgilityLearn, adapt, shape the world. Excellence and DeterminationMaintain the highest standards. One TeamDo what’s best for the company.", "offer": []}, {"name": "Ola", "socials": [["Website", "https://olacabs.com/"], ["Twitter", "https://twitter.com/Olacabs"], ["LinkedIn", "https://linkedin.com/company/olacabs-com"]], "founded": "2010", "employees": "50K - 10K", "about": "Ola is India’s largest mobility platform and one of the world’s largest ride-hailing companies, serving 250+ cities across India, Australia, New Zealand, and the UK. The Ola app offers mobility solutions by connecting customers to drivers and a wide range of vehicles across bikes, auto-rickshaws, metered taxis, and cabs, enabling convenience and transparency for hundreds of millions of consumers and over 1.5 million driver-partners. Ola’s core mobility offering in India is supplemented by its electric-vehicle arm, Ola Electric; India’s largest fleet management business, Ola Fleet Technologies and Ola Skilling, that aims to enable millions of livelihood opportunities for India's youth. With its acquisition of Ridlr, India’s leading public transportation app, and investment in Vogo, a dockless scooter sharing solution, Ola is looking to build mobility for the next billion Indians. Ola also extends its consumer offerings like micro-insurance and credit-led payments through Ola Financial Services and a range of owned food brands through India’s largest network of kitchens under its Food business.", "statement": "Ola's mission is to build mobility for a billion people.", "values": "", "offer": []}, {"name": "OLX Group", "socials": [["Website", "https://olxgroup.com/"], ["LinkedIn", "https://linkedin.com/company/olx-group/"]], "founded": "2006", "employees": "10K+", "about": "OLX Group is one of the world’s fastest-growing networks of trading platforms, operating in 30+ countries around the world. OLX Group helps people buy and sell cars, find housing, get jobs, buy and sell household goods, and much more. With more than 20 well-loved local brands including Avito, OLX, OLX Autos, Otomoto, and Property24, their solutions are built to be safe, smart, and convenient for our customers. OLX Group is powered by a team of 11,000+ people, working across 5 continents in offices all around the world. ", "statement": "OLX Group’s purpose is to shape the future of trade to unlock the hidden value in everything. ", "values": "", "offer": []}, {"name": "Open", "socials": [["Website", "https://open.money/"], ["Twitter", "https://twitter.com/BankWithOpen/"], ["LinkedIn", "https://linkedin.com/company/bankwithopen/"]], "founded": "2017", "employees": "201 - 500", "about": "Open is Asia’s first neo banking platform for SMEs and startups. Open is on a mission to deliver a truly seamless business banking experience and make managing finances a breeze. Powered by partner banks, Open offers a business account that let’s small business owners collect payments, auto-reconcile them, and make seamless payouts. They also offer additional tools designed exclusively for businesses, such as an integrated payment gateway, automated accounting, and expense management. Open has been revolutionizing the way SMEs and startups bank since 2017 and we currently serve more than 15,00,000 SMEs and process USD 24 Billion in transactions annually. The platform onboards 50,000 new SMEs and startups every month.", "statement": "Open's mission is to deliver a truly seamless business banking experience and make managing finances a breeze.", "values": "", "offer": []}, {"name": "Oracle", "socials": [["Website", "https://oracle.com/"], ["Twitter", "https://twitter.com/Oracle"], ["LinkedIn", "https://linkedin.com/company/oracle/"]], "founded": "1977", "employees": "10K+", "about": "Oracle is a cloud technology company that provides organizations around the world with computing infrastructure and software to help them innovate, unlock efficiencies and become more effective. They also created the world’s first and only autonomous database to help organize and secure our customers’ data. Oracle Cloud Infrastructure offers higher performance, security, and cost savings. It is designed so businesses can move workloads easily from on-premises systems to the cloud, and between cloud and on-premises and other clouds. Oracle Cloud applications provide business leaders with modern applications that help them innovate, attain sustainable growth, and become more resilient. ", "statement": "Oracle's mission is to help people see data in new ways, discover insights, unlock endless possibilities.", "values": "IntegrityWe are honest and make responsible decisions. We speak up for what is right. Customer SatisfactionOur customers are our top priority. We make every effort to understand their needs. Mutual RespectWe treat each other with respect and dignity. We value the unique contributions that each individual brings. QualityWe strive for excellence. We hold ourselves to the highest possible standards and always try to improve. TeamworkWe work together to make things the best they can be. We collaborate, share ideas, and give constructive feedback. FairnessWe treat everyone we work with fairly. We do everything we can to make sure our decisions are free from bias. CommunicationWe share knowledge effectively with one another. We respect the need for confidentiality regarding certain information. ComplianceWe comply with all laws, regulations, and policies that govern Oracle’s business and our own actions. InnovationWe welcome new ideas and dare to try new things. Problems are solved where creativity and technical expertise meet. EthicsWe uphold the highest standards of moral behavior and we act ethically at all times.", "offer": []}, {"name": "Oyo", "socials": [["Website", "https://oyorooms.com/"], ["Twitter", "https://twitter.com/oyorooms"], ["LinkedIn", "https://linkedin.com/company/oyo-rooms/"]], "founded": "", "employees": "10K+", "about": "OYO is a global platform that aims to empower entrepreneurs and small businesses with hotels and homes by providing full-stack technology products and services that aims to increase revenue and ease operations; bringing easy-to-book, affordable, and trusted accommodation to customers around the world. OYO offers 40+ integrated products and solutions to patrons who operate over 157K hotel and home storefronts in more than 35 countries including India, Europe, and Southeast Asia. OYO operates a unique business model that helps its patrons transform fragmented, unbranded, and underutilized hospitality assets into branded, digitally-enabled storefronts with higher revenue generation potential and provides its customers with access to a broad range of high-quality storefronts at compelling price points. ", "statement": "Oyo is aimed at Bringing affordable and trusted accommodation that guests can book instantly.", "values": "", "offer": []}, {"name": "PayPal", "socials": [["Website", "https://paypal.com/"], ["Twitter", "https://twitter.com/PayPal"], ["LinkedIn", "https://linkedin.com/company/paypal/"]], "founded": "1998", "employees": "10K+", "about": "Fueled by a fundamental belief that having access to financial services creates opportunity, PayPal is committed to democratizing financial services and empowering people and businesses to join and thrive in the global economy. Their open digital payments platform gives PayPal’s 325 million active account holders the confidence to connect and transact in new and powerful ways, whether they are online, on a mobile device, in an app, or in person. Through a combination of technological innovation and strategic partnerships, PayPal creates better ways to manage and move money and offers choice and flexibility when sending payments, paying, or getting paid.  Available in more than 200 markets around the world, the PayPal platform, including Braintree, Venmo, and Xoom, enables consumers and merchants to receive money in more than 100 currencies, withdraw funds in 56 currencies and hold balances in their PayPal accounts in 25 currencies.", "statement": "The mission of PayPal is to democratize financial services for people all over the world", "values": "The One Team Behaviours at PayPal are:Innovation: Creating amazing customer experiences Collaboration: Execute and win as one team Inclusion: Respect and value uniquenesses Wellness: Care for yourself and each other", "offer": []}, {"name": "Paytm", "socials": [["Website", "https://paytm.com/"], ["Twitter", "https://twitter.com/paytm"], ["LinkedIn", "https://linkedin.com/company/paytm/"]], "founded": "2009", "employees": "10K+", "about": "Paytm started the Digital Revolution in India. It went on to become India’s leading Payments App. Today, more than 20 Million merchants & businesses are powered by Paytm to Accept Payments digitally. As of now, more than 300 million Indians use Paytm to pay at their stores. Paytm app is used to pay bills, do recharges, send money to friends & family, Book movies & travel tickets. With innovations to Financial services & products in the pipeline, Paytm is moving towards its mission – to bring 500 million unserved and underserved Indians to the mainstream economy.", "statement": "The mission of Paytm is to ‘bring Half-a-Billion Indians to the Mainstream Economy'.", "values": "Push BoundariesThink differently. We love to innovate, find new ways of doing things, and leverage technology to simplify everything we do. Entrepreneurial spiritBring a hunger to learn. Set goals and build plans to achieve them. Be brave, remove barriers and let your curiosity guide you. Do great things, fastWe're committed to executing flawless solutions, fast. As a team, we work together efficiently to get shit done. We before meWe leave our egos at the door. Here, we're committed to solving real problems. We celebrate wins together and learn from losses. CommunicateThe best ideas come out when we discuss it with like-minded individuals. Never fear to speak up. We brainstorm, we hash it out, but in the end, we get the best product possible. Sharing is growingWe never shy away from sharing a good idea. Every idea that helps to add a new product or feature is encouraged and the ripple effect is seen once that idea starts making a difference to the lives of millions.", "offer": []}, {"name": "PayU", "socials": [["Website", "https://payu.in/"], ["Twitter", "https://twitter.com/PayUindia"], ["LinkedIn", "https://linkedin.com/company/payu/"]], "founded": "2006", "employees": "1K - 5K", "about": "PayU, the payments, and fintech business of Proses, is a payment service provider to online merchants. They are a truly global company, operating in 50+ markets and home to 43 different nationalities. PayU successfully bridges the global and local gap by supplying ultimate global payment coverage with extensive local expertise and support. PayU deploys more than 400 payment methods and PCI-certified platforms to process approximately 3.2 million payments daily.  As a Fintech innovator, PayU develops cutting-edge technologies to ensure that merchants benefit from the highest approval rates and can optimally expand their global reach. In India, PayU serves more than 4,50,000+ merchants with over 100+ payment methods and is the preferred payment partner for e-commerce merchants, including all leading e-commerce companies and a majority of airline businesses.", "statement": "VisionA world without financial borders where everyone can prosper MissionTo create a safe and secure ecosystem that enables anybody to make or receive payments, bringing convenience and trust through continuous innovation leveraging technology.", "values": "The core values of PayU are: OpennessBe accessible. Think globally. Listen deeply. Embrace diversity. IntegrityDo what you say. Build trust. Act fairly. CollaborationBe united. Value each other. Share knowledge. Support one another. CourageTake risks. Learn from failure. Push the boundaries. OwnershipBe responsible. Take initiative. Stay focused. See things through.", "offer": []}, {"name": "PharmEasy", "socials": [["Website", "https://pharmeasy.in/"], ["Twitter", "https://twitter.com/pharmeasyapp/"], ["LinkedIn", "https://linkedin.com/company/pharmeasy/"]], "founded": "2015", "employees": "1K - 5K", "about": "Started with the sole purpose of making healthcare accessible and affordable to all, PharmEasy is India’s leading online healthcare aggregator in the country. PharmEasy helps patients connect with local pharmacy stores and diagnostic centers to fulfill their extensive medical needs. Their services ensure that everyone gets access to the best and most genuine health products, with the highest savings in the shortest time possible. PharmEasy delivers medicines in 1000+ cities in India, covering 22000+ pin codes, and also offers diagnostic test services across Mumbai including Thane, Navi Mumbai, Kalyan & Dombivali, Delhi with Noida, Gurgaon, Faridabad & Ghaziabad, Chennai, Pune, Ahmedabad, and Gandhi Nagar, Surat, Vadodara, Lucknow, Kolkata, Hyderabad, Bengaluru, and Jaipur.", "statement": "The ultimate goal of PharmEasy is to provide affordable healthcare to one and all.", "values": "The core values at PharmEasy are: Be Like Family Customer First Never Say Die. Never! Being Frugal Matters Raise the Bar, Always! Speak Up. Commit. Deliver Act. Fail Fast. Learn", "offer": []}, {"name": "PhonePe", "socials": [["Website", "https://phonepe.com/"], ["Twitter", "https://twitter.com/PhonePe_"], ["LinkedIn", "https://linkedin.com/company/phonepe-internet/"]], "founded": "2015", "employees": "1K - 5K", "about": "PhonePe is an Indian digital payments and financial services company based out of Bangalore, India. It was founded in 2015, by Sameer Nigam, Rahul Chari, and Burzin Engineer. The PhonePe app, based on the Unified Payments Interface, went live in August 2016. PhonePe offers a wide range of services for the common people as well as for businesses enhancing their payment experiences.  They also have additional features which will help people handle their finances by helping them in investing, paying for services. etc. PhonePe was acquired by Flipkart in 2016 and is India's one of the fastest-growing fintech companies. It has crossed the 250 million registered users mark in 2020, the market-leading share of over 40% in UPI transactions.", "statement": "Vision To build a large, scalable & open transaction ecosystem that creates the maximum positive impact for all stakeholders.", "values": "Customer First Our customers are our first and primary stakeholders, and we will only succeed in our vision if we create long-term value for them by building simple, reliable, and value-additive solutions.  Positive Disruption Our business solutions are designed to be inclusive and empowering for all ecosystem players.  Holistic Approach We start with a holistic understanding of the problem statement before designing solutions for customers. We then create the most optimal solution possible based on first principles.  Learn Fast, Fail Fast We set audacious goals and are not limited by incremental thinking. We take calculated risks to achieve goals, and celebrate both success and failure.  Simplicity Breeds Scalability ‘Fools ignore complexity. Pragmatists suffer it. Some can avoid it. Geniuses remove it.’ We will attempt to be geniuses.  Bias for Impact We will focus on quality and impact of output rather than mindless activity", "offer": []}, {"name": "Pine Labs", "socials": [["Website", "https://pinelabs.com/"], ["Twitter", "https://twitter.com/PineLabs"], ["LinkedIn", "https://linkedin.com/company/pinelabs/"]], "founded": "1998", "employees": "1K - 5K", "about": "Pine Labs offers a merchant platform that includes technology and financial solutions for merchants to help them in increasing their revenue, reduce the cost and complexity of running a business, and manage the risks involved. The company connects financial institutions and consumer brands to empower merchants to deliver value to their retail customers. Pine Labs and its technology platform power offline and online last-mile retail transactions, provide customer insights to merchants for targeted sales, and offer risk-managed financial solutions for merchants’ business growth. Today, over 1,00,000 merchants in India and several other Asian countries, use Pine Labs’ platform and solutions to run accessible, affordable, speedy, and risk-managed last-mile retail operations. Pine Labs’ solutions are used by merchants from diverse sectors - electronics, food & beverage, fashion, pharmacy, telecom, and airlines.  The company’s cloud-based platform powers over 3,30,000 point-of-sale terminals. Over 550 million digital transactions are processed over Pine Labs’ platforms every year, helping more than 100 million retail customers. The company has a presence in 3700 cities and towns across India and Malaysia. 15 major banks, seven financial services institutions, and over 100 brands are currently a part of Pine Labs’ platform.", "statement": "VisionWe believe that every business can grow exponentially with technology and capital. MissionManiacal focus on creating a product and services platform that widens access and accelerates commerce for merchants in each local market we operate in.", "values": "SpeedWe strive to resolve our customers’ problems quickly and definitively. We do not postpone. We use speed as a differentiator for product development and process charting. IntegrityWe always do the right thing. We are explicit in our words and actions. We do not hide behind ambiguity or ignorance. When we don’t know, we ask questions. DiversityWe value people for who they are. We work to leverage the collective energy, ideas and skills to build the best possible products and processes. ExperimentationWe learn by doing, and from our mistakes. We enter new territories ahead of our customers’ expectations. SimplicityWe use complex technology, big data and machine learning, but we simplify them for our community. We make products and processes that are intuitive and easy to use.", "offer": []}, {"name": "PolicyBazaar", "socials": [["Website", "https://policybazaar.com/"], ["Twitter", "https://twitter.com/policybazaar"], ["LinkedIn", "https://linkedin.com/company/policybazaar/"]], "founded": "2008", "employees": "1K - 5K", "about": "PolicyBazaar is India's prominent online life insurance and general insurance aggregator. They are specialized in making comparative analyses of insurance products. The basis for the comparison is price, quality, and key benefits. PolicyBazaar has built strong relationships with all prominent public and private insurance companies across India. PolicyBazaar's partners are from life insurance, health insurance, car insurance, travel insurance, corporate insurance, and loan sectors. According to Frost & Sullivan, PolicyBazaar has a 93.4% market share based on the number of policies sold and 65.3% of all digital insurance sales in India by volume was transacted through them [FY 2020].", "statement": "MissionBuilding a safety net for households in India. VisionA healthy and well-protected India", "values": "The core value of PolicyBazaar is to ensure Fairness to all our stakeholders.", "offer": []}, {"name": "Polygon", "socials": [["Website", "https://polygon.technology/"], ["Twitter", "https://twitter.com/0xPolygon"], ["LinkedIn", "https://linkedin.com/company/0xpolygon/"]], "founded": "2017", "employees": "201 - 500", "about": "Polygon is the first well-structured, easy-to-use platform for Ethereum scaling and infrastructure development. Its core component is Polygon SDK, a modular, flexible framework that supports building multiple types of applications. Using Polygon, one can create Optimistic Rollup chains, ZK Rollup chains, stand-alone chains, or any other kind of infra required by the developer. Polygon effectively transforms Ethereum into a full-fledged multi-chain system (aka Internet of Blockchains). This multi-chain system is akin to other ones such as Polkadot, Cosmos, Avalanche, etc with the advantages of Ethereum’s security, vibrant ecosystem, and openness. With Polygon, new features are being built around the existing proven technology to expand the ability to cater to diverse needs from the developer ecosystem. Polygon will continue to develop the core technology so that it can scale to a larger ecosystem. The $MATIC token will continue to exist and will play an increasingly important role, in securing the system and enabling governance.", "statement": "Polygon's mission is to help scale Ethereum in the fastest and the most secure manner.", "values": "", "offer": []}, {"name": "Postman", "socials": [["Website", "https://postman.com/"], ["Twitter", "https://twitter.com/getpostman"], ["LinkedIn", "https://linkedin.com/company/postman-platform"]], "founded": "2014", "employees": "501 - 1K", "about": "Postman is the world’s leading API platform. Postman's features simplify each step of building an API and streamline collaboration to help create better APIs—faster. More than 17 million developers and 500,000 organizations across the globe use Postman today. It offers a variety of tools such as API repository, Tools, Intelligence, Workspaces, etc. Postman helps simplify each step of the API lifecycle and streamlines collaboration, which will help the developers create better APIs faster.", "statement": "", "values": "Create with CuriosityWe repeatedly ask 'why?' and challenge best practices. Earn TrustWe seek input first and actively listen before taking action. Embrace ConstraintsWe recognize that clear priorities promote efficiency and quality. Win TogetherWe count on each other, always offer help, and focus on solutions. Own & DeliverWe learn from our mistakes and adapt with ease.", "offer": []}, {"name": "Quikr", "socials": [["Website", "https://quikr.com/"], ["Twitter", "https://linkedin.com/company/quikr/"], ["LinkedIn", "https://linkedin.com/company/quikr/"]], "founded": "2008", "employees": "1K - 5K", "about": "Quikr, which now operates leading transaction marketplaces built on top of India’s largest classifieds platform, is India’s largest platform that is used by over 30 million unique users a month. It is present in 1200 cities in India and operates several large classifieds businesses across C2C, Cars, Education, Homes, Jobs, and Services. Quikr is the only classifieds platform not just in India but globally to go in for verticalization. The change in strategy helped them go deeper into their key verticals - QuikrC2C for goods, QuikrCars for cars and bikes, QuikrHomes for residential and commercial properties, QuikrJobs for blue/grey collar jobs, and QuikrServices for daily and long term services need to offer a richer consumer experience. They also offer other services that aides to the buying and selling experience of the users. ", "statement": "The aim of Quikr is to empower every person in the country to independently connect with buyers and sellers online.", "values": "The core values of Quikr are: Flexibility  Innovation  Frugality  Transparency  Speed", "offer": []}, {"name": "Razorpay", "socials": [["Website", "https://razorpay.com/"], ["Twitter", "https://twitter.com/Razorpay"], ["LinkedIn", "https://linkedin.com/company/razorpay/"]], "founded": "2014", "employees": "1K - 5K", "about": "Razorpay is an Indian Fin-Tech startup that aims to revolutionize money management for online businesses by providing clean, developer-friendly APIs and hassle-free integration. Razorpay offers a fast, affordable and secure way for merchants, schools, e-commerce, and other companies to accept and disburse payments online, own a fully-functional current account, and avail of working capital loans. Razorpay is the only payments solution in India that allows businesses to accept, process, and disburse payments with its product suite. It gives you access to all payment modes including credit card, debit card, net banking, UPI, and popular wallets including JioMoney, Mobikwik, Airtel Money, FreeCharge, Ola Money, and PayZapp. RazorpayX is another product that supercharges your business banking experience, bringing effectiveness, efficiency, and excellence to all financial processes. With RazorpayX, businesses can get access to fully-functional current accounts, supercharge their payouts and automate payroll compliance.", "statement": "Razorpay’s mission and vision lie in the objective of making the payments easier; making it super-simple for businesses to accept and receive payments.", "values": "", "offer": []}, {"name": "redBus", "socials": [["Website", "https://redbus.com/"], ["Twitter", "https://twitter.com/redBus_in"], ["LinkedIn", "https://linkedin.com/company/redbus_2/"]], "founded": "2006", "employees": "1K - 5K", "about": "redBus is the world's largest online bus ticketing platform built in India. redBus has morphed into an Indian multinational with a footprint in Singapore, Malaysia, Indonesia, Colombia, Peru and expanding into other geographies. Millions of customers, over 70,000 routes, association with over 3000 reputed bus operators – our ecosystem offers a level of complexity and opportunity that the brightest minds will thrive on. ", "statement": "", "values": "CuriousI am inquisitive, I ask questions to absorb, reflect and solve. I strive to learn & understand how my work is connected to others. I am flexible and open to ideas. Customer FocusWe use customer lens proactively to anticipate and understand customer expectations. We keep customers at the center of our deliberations, decisions, and debates to champion their interests. CreativityI am inventive. I bring fresh perspective, I am experimental, I create new options and possibilities. Commitment to ResultsWe take the highest level of ownership and accountability for every task at hand. We achieve superior results and execute well even in the face of all odds. CaringI am genuine & helpful, I support & empathise, I nurture and invest in relationships, I collaborate & co-create. Continuous ImprovementWe make ongoing efforts to enhance our products, services, and processes. We believe that incremental changes are the cornerstones of breakthrough innovations.", "offer": []}, {"name": "Rippling", "socials": [["Website", "https://rippling.com/"], ["Twitter", "https://twitter.com/rippling"], ["LinkedIn", "https://linkedin.com/company/rippling"]], "founded": "2018", "employees": "500 - 1K", "about": "Rippling is the first way for businesses to manage all of their HR & IT - payroll, benefits, computers, apps, and more - in one unified workforce platform. By connecting every workforce system to a single source of truth for employee data, businesses can automate all of the manual work they normally need to do to make employee changes. Take onboarding, for example. With Rippling, you can just click a button and set up a new employees' payroll, health insurance, work computer, and third-party apps - like Slack, Zoom, and Office 365 - all within 90 seconds.", "statement": "Rippling’s mission is to free smart people to work on hard problems—and we need an exceptionally diverse and dedicated team to do it.", "values": "We’re not only motivated by what we do. It’s also about how we do it. We’ve got a clear understanding of how people succeed at Rippling. HumilityWe try to understand others before trying to be understood, even when it’s inconvenient. IntegrityWe try to do the right thing, especially when it’s inconvenient. ResponsibilityWe take responsibility for our role in every outcome, especially when it’s inconvenient. Never not my problemWe’re willing to step out of our lane to make life better for each other, and our customers. We push the limitsWe dream one size bigger. We always have the audacity to challenge the status quo. We run hardIn business, every second matters. We act quickly and execute with urgency.", "offer": []}, {"name": "Rubrik", "socials": [["Website", "https://rubrik.com/"], ["Twitter", "https://twitter.com/rubrikInc"], ["LinkedIn", "https://linkedin.com/company/rubrik-inc/"]], "founded": "2014", "employees": "1K - 5K", "about": "Rubrik, the Zero Trust Data Security Company™, delivers data security and operational resilience for enterprises. Rubrik helps enterprises achieve data control to drive business resiliency, cloud mobility, and regulatory compliance. They are trusted by the world's leading companies and industry-leading partners.", "statement": "", "values": "Here are the core values of Rubrik:Relentlessness Integrity Velocity Excellence Transparency", "offer": []}, {"name": "Salesforce", "socials": [["Website", "https://salesforce.com/"], ["Twitter", "https://twitter.com/salesforceapac"], ["LinkedIn", "https://linkedin.com/company/salesforce/"]], "founded": "1999", "employees": "10K+", "about": "Salesforce is an American, cloud-based customer relationship management (CRM) company. Salesforce now provides essential services to many of the world’s biggest and most critical businesses, governments, and organizations. They are the world’s #1 customer relationship management (CRM) platform and help companies in marketing, sales, commerce, service and IT teams work as one from anywhere. Over 150,000 companies across the world, both big and small, use the products offered by Salesforce for growing their business. The products of Salesforce are used in a lot of industries like Financial Services, Healthcare & Life Sciences, Communications, Consumer Goods, Public Sector, Manufacturing, etc. Customer 360, being the major suite unites all the teams around the customer. Customer 360 with Slack brings sales, service, marketing, commerce, IT, and analytics together through digital workflows that power your digital HQ.", "statement": "", "values": "TrustWe act as trusted advisors. We earn the trust of our customers, employees, and extended family through transparency, security, compliance, privacy, and performance. And we deliver the industry’s most trusted infrastructure. Customer SuccessWhen our customers succeed, we succeed. So we champion them to achieve extraordinary things. We innovate and expand our business offerings to provide all our stakeholders with new avenues to achieve ever greater success. InnovationWe innovate together. Our customers’ input helps us develop products that best serve their business needs. Providing continual technology releases and new initiatives gives our customers a competitive advantage. EqualityEveryone deserves equal opportunities. We believe everyone should be seen, heard, valued, and empowered to succeed. Hearing diverse perspectives fuels innovation, deepens connections between people, and makes us a better company.", "offer": []}, {"name": "Samsung", "socials": [["Website", "https://samsung.com/"], ["Twitter", "https://twitter.com/samsung"], ["LinkedIn", "https://linkedin.com/company/samsung-electronics/"]], "founded": "1969", "employees": "10K+", "about": "Samsung is a global leader in technology, opening new possibilities for people everywhere. Through relentless innovation and discovery, they are transforming the worlds of TVs, smartphones, wearable devices, tablets, digital appliances, network systems, medical devices, semiconductors, and LED solutions. Samsung is also leading in the Internet of Things space through, among others, our Smart Home and Digital Health initiatives. Since being established in 1969, Samsung has grown into one of the world’s leading technology companies, and become recognized as one of the top 10 global brands.", "statement": "Samsung follows a simple business philosophy: to devote its talent and technology to creating superior products and services that contribute to a better global society. The mission of Samsung is:", "values": "PeopleQuite simply, a company is its people. At Samsung, we’re dedicated to giving our people a wealth of opportunities to reach their full potential. ExcellenceEverything we do at Samsung is driven by an unyielding passion for excellence and an unfaltering commitment to develop the best products and services on the market ChangeAs we have done since our foundation, we set our sights on the future, anticipating market needs and demands so we can steer our company toward long-term success. IntegrityOperating in an ethical way is the foundation of our business. Everything we do is guided by a moral compass that ensures fairness, respect for all stakeholders and complete transparency. Co-prosperitySamsung is committed to becoming a socially and environmentally responsible corporate citizen in all of its communities worldwide.", "offer": []}, {"name": "Sap Labs", "socials": [["Website", "https://sap.com/"], ["Twitter", "https://twitter.com/sap"], ["LinkedIn", "https://linkedin.com/company/sap/about"]], "founded": "1972", "employees": "10K+", "about": "SAP is a German multinational software company that develops enterprise software to manage business operations and customer relations. SAP innovations help thousands of customers worldwide work together more efficiently and use business insight more effectively. SAP is the market leader in enterprise application software, helping companies of all sizes and in all industries run at their best: SAP customers generate 87% of total global commerce. Their machine learning, Internet of Things (IoT), and advanced analytics technologies help turn customers’ businesses into intelligent enterprises. SAP's end-to-end suite of applications and services enables our customers to operate profitably, adapt continuously, and make a difference.", "statement": "SAP's purpose is to help the world run better and improve people’s lives.", "values": "The five principles at SAP are:  Tell it like it isWe build trust by being honest and authentic. We are professional and constructive – and we create platforms where people can openly exchange ideas. Stay curiousWe never stop pushing boundaries of what our solutions can do for people and for the world. We are always improving and adapting to stay ahead. Embrace differencesWe are a diverse and global team. All of us have unique skills and experiences that create value for our customers. Keep promisesWe have a long history of solving complex business challenges. That's why our customers trust us. We work as one team to constantly earn this trust, delivering the best outcome in the simplest way possible. Build bridgesWe put egos aside and work as a team towards a common vision. The competition is outside, not inside.", "offer": []}, {"name": "Setu", "socials": [["Website", "https://setu.co/"], ["Twitter", "https://twitter.com/Setu_API"], ["LinkedIn", "https://linkedin.com/company/setu-apis"]], "founded": "2018", "employees": "51 - 200", "about": "Setu is a fintech startup started in 2018 and based in Bengaluru. Setu creates software infrastructure for companies that help make financial inclusion possible. They offer a robust solution for each of India’s market needs and myriad use cases. Setu is rebuilding and future-proofing India’s fintech architecture by offering APIs for various use cases and hence allowing the companies to scale their infrastructure.", "statement": "Mission Accelerate India’s economic growth by making financial services accessible and affordable to all. Vision Build infrastructure that enables the large-scale distribution of, and access to, financial products", "values": "Keep your promises at all costs. Do the right thing always. We’re always trying to be better for our partners and customers. How can we best persist in an ever-changing world of challenges? We actively seek and learn from everyone around us. We obsess over the details, and we set a high bar for ourselves. Take massive problems head-on. They are always worth solving.", "offer": []}, {"name": "ShareChat", "socials": [["Website", "https://sharechat.com/about"], ["Twitter", "https://twitter.com/sharechatapp"], ["LinkedIn", "https://linkedin.com/company/sharechat"]], "founded": "2015", "employees": "1K - 5K", "about": "ShareChat is India’s leading social media platform that operates exclusively in Indic languages. ShareChat empowers over 160 million strong monthly active user community to share their opinions, record their lives and make new friends - all within the comfort of their language of choice. They also own the short video platform Moj, which is today India's preferred short video destination with tens of millions of users from across the world. The platform has been designed for artists and creators to create innovative short video content and display their creativity to millions, globally. The team at ShareChat is spearheading India's internet revolution. By providing a meaningful social experience, ShareChat is determining how the next billion users will interact on the internet.", "statement": "", "values": "OwnershipYou own the problem you are solving. Be accountable User EmpathyUser is the king. Be humble enough to talk to them. They feel things you don’t. SpeedLaunch, Measure, Iterate, Win. Be Quick! IntegrityCommit earnestly, Measure honestly. Growth follows First PrinciplesBreak the problem statement to the elemental unit and reason back from there. Question all assumptions.", "offer": []}, {"name": "Slack", "socials": [["Website", "https://slack.com/"], ["Twitter", "https://twitter.com/slackhq"], ["LinkedIn", "https://linkedin.com/company/tiny-spec-inc"]], "founded": "2009", "employees": "1K - 5K", "about": "Slack is the collaboration hub that brings the right people, information, and tools together to get work done. From FTSE 100 companies to corner shops, millions of people around the world use Slack to connect their teams, unify their systems and drive their business forwards. Slack has transformed business communication. It’s the leading channel-based messaging platform, used by millions to align their teams, unify their systems, and drive their businesses forward. Slack offers a secure, enterprise-grade environment that can scale with the largest companies in the world. It is a new layer of the business technology stack where people can work together more effectively, connect all their other software tools and services, and find the information they need to do their best work.", "statement": "Slack is on a mission to make your working life simpler, more pleasant and more productive.", "values": "The core values of Slack are:Solidarity Playfulness Craftsmanship Thriving Courtesy Empathy", "offer": []}, {"name": "slice", "socials": [["Website", "https://sliceit.com/"], ["Twitter", "https://twitter.com/sliceit_"], ["LinkedIn", "https://linkedin.com/company/sliceit/"]], "founded": "2016", "employees": "501 - 1K", "about": "slice is a fintech startup focused on India’s youngsters aimed at building a smart, simple, and transparent financial platform to redesign the financial experience for the millennials. slice is backed by leading investors such as Tiger Global, Insight partners, Advent International, Blume Ventures, and Gunosy Capital.", "statement": "The aim of slice is to build an ecosystem for the youth that solves all their financial needs and make their lives epic!", "values": "", "offer": []}, {"name": "Smallcase", "socials": [["Website", "https://smallcase.com/"], ["Twitter", "https://twitter.com/smallcaseHQ"], ["LinkedIn", "https://linkedin.com/company/smallcase"]], "founded": "2015", "employees": "51 - 200", "about": "Smallcase is a fintech company building a trusted financial ecosystem with advisors, brokers, and other market participants for the investor. The products are used every day across the Indian capital markets landscape by the most respected brands to provide delightful customer experiences.", "statement": "", "values": "", "offer": []}, {"name": "Snapdeal", "socials": [["Website", "https://snapdeal.com/"], ["Twitter", "https://twitter.com/snapdeal"], ["LinkedIn", "https://linkedin.com/company/snapdeal/"]], "founded": "2010", "employees": "1K - 5K", "about": "Snapdeal is India's leading value e-commerce platform that has helped Indian e-commerce grow beyond just brands & urban users. Nearly 80% of Snapdeal's users come from non-metro locations highlighting its deep reach across the length and breadth of the country. Snapdeal hosts a wide selection of good quality, value-priced merchandise across fashion, home, beauty & personal care, general merchandise, and other categories. With more than 200 Mn app installations, it is one of India's top online shopping destinations.", "statement": "VisionAt Snapdeal, we aim to become India’s go-to shopping destination for value-conscious consumers-both online and offline. Snapdeal believes in transforming people’s lives and meet their aspirations through a sustainable ecosystem that is built on trust, respect, inclusion and conscientiousness. Positive Impact is at the core of Snapdeal’s strategy. MissionSnapdeal’s mission is to help Indian families unlock and achieve their aspirations by acquiring trendy and stylish products at affordable prices.", "values": "Always be CuriousAt Snapdeal, we ask questions and a lot of them. And we continue to do so till we get to the heart of the matter. Own OutcomesWe recognize that while efforts are essential, they must bring quantable results. Hence, we take complete ownership responsibility for the results and not just for the process. Be RelentlessAt Snapdeal, we do not give up. We make it happen- no matter what it takes and how long. Do the Right ThingEvery step that we take has to be in the interest of the organization. While what is right will vary in different situations, we should use our judgment to determine the right action Be RespectfulEverybody matters at Snapdeal – both Internal and External stakeholders. Every interaction, in person or virtual, gives us the opportunity to show respect.", "offer": []}, {"name": "Spenny", "socials": [["Website", "https://spennyapp.com/"], ["Twitter", "https://twitter.com/spennyapp"], ["LinkedIn", "https://linkedin.com/company/spenny/"]], "founded": "2019", "employees": "11 - 50", "about": "Spenny is the easiest & the fastest way to save & invest. Every time you do any transaction, Spenny rounds up the amount to the nearest Rs.10 and invests it into a diversified portfolio automatically. Currently, the saved money is invested into ICICI Prudential Liquid Mutual Fund. It has a low-risk profile and has had returns of 7.6% since inception, which is more than 2x the return on savings bank account.", "statement": "", "values": "", "offer": []}, {"name": "Stripe", "socials": [["Website", "https://stripe.com/"], ["Twitter", "https://twitter.com/stripe"], ["LinkedIn", "https://linkedin.com/company/stripe/"]], "founded": "2010", "employees": "1K - 5K", "about": "Stripe is a technology company that builds economic infrastructure for the internet. Businesses of every size - from new startups to public companies- use their software to accept online payments and run technically sophisticated financial operations in more than 100 countries. Stripe combines a payments platform with applications that put revenue data at the heart of business operations. Stripe helps new companies get started and grow their revenues, and established businesses accelerate into new markets and launch new business models.  Stripe works with financial institutions, regulators, payment networks, banks, and consumer wallets so as to make the processes easier for all the businesses that run on Stripe. It is one of the most valued startups across the world and the most valued in the United States.", "statement": "Stripe's mission is to increase the GDP of the internet", "values": "A great deal of your fulfillment at any company is determined by the extent to which the values of the people and the organization align with your own. Here are the core values followed at Stripe. We haven't won yet Move with Urgency and FocusOur users entrust us with their money, their businesses, and their livelihoods. Millions of businesses around the world (individuals, startups, and large enterprises) are open for business only if we are. When we mess up, miss a deadline, or slow down, it matters. We take that responsibility seriously. Think RigorouslyWe care about being right and it often takes reasoning from first principles to get there. Trust and AmplifyBy the standards of the rest of the world, we overtrust. We’re okay with that. Global OptimizationStripes do what’s best for the organization overall. The Stripe ServiceThrough the tools that we build, we want to push the world to create better products and services. OptimismWe are micro pessimists but macro optimists.", "offer": []}, {"name": "Swiggy", "socials": [["Website", "https://swiggy.com/"], ["Twitter", "https://twitter.com/swiggy_in"], ["LinkedIn", "https://linkedin.com/company/swiggy-in/"]], "founded": "2014", "employees": "5K - 10K", "about": "Swiggy is India’s leading on-demand delivery platform with a tech-first approach to logistics and a solution-first approach to consumer demands. With a presence in 500 cities across India, partnerships with hundreds of thousands of restaurants, an employee base of over 5000, a 2 lakh+ strong independent fleet of Delivery Executives, we deliver unparalleled convenience driven by continuous innovation. Built on the back of robust ML technology and fuelled by terabytes of data processed every day, Swiggy offers a fast, seamless and reliable delivery experience for millions of customers across India. From starting out as a hyperlocal food delivery service in 2014 to becoming a logistics hub of excellence today, Swiggy's capabilities result not only in lightning-fast delivery for customers but also in a productive and fulfilling experience for their employees. With Swiggy’s New Supply and the recent launches of Swiggy Instamart, Swiggy Genie, and Health Hub, they are consistently making waves in the market, while continually growing the opportunities we offer our people.", "statement": "Swiggy’s vision is to elevate the quality of life of urban consumers by providing unparalleled convenience.", "values": "Here are the 8 core values of Swiggy:Consumer comes first Be honest, display the highest levels of integrity Stand up, disagree & commit Exhibit bias for action Act like an owner Always be curious, always be learning Be humble Strive for excellence", "offer": []}, {"name": "Target", "socials": [["Website", "https://target.com/"], ["Twitter", "https://twitter.com/Target"], ["LinkedIn", "https://linkedin.com/company/target/"]], "founded": "1902", "employees": "10K+", "about": "Target is one of the world’s most recognized brands and one of America’s leading retailers. Target offers outstanding value, inspiration, innovation, and an exceptional guest experience that no other retailer can deliver. Target is committed to responsible corporate citizenship, ethical business practices, environmental stewardship, and generous community support. Since 1946, Target has given 5 percent of its profits back to the communities. Their goal is to work as one team to fulfill our unique brand promise to our guests, wherever and whenever they choose to shop.", "statement": "The mission of Target is To help all families discover the joy of everyday life.", "values": "The values of Target is to Care, grow and win together.", "offer": []}, {"name": "Tekion", "socials": [["Website", "https://tekion.com/"], ["Twitter", "https://twitter.com/tekioncorp"], ["LinkedIn", "https://linkedin.com/company/tekion"]], "founded": "2016", "employees": "1K - 5K", "about": "Tekion is building the world’s best business applications on the cloud starting with the automotive retail industry. They inherently use cutting-edge technologies like big data, machine learning/AI, and human-computer interaction (voice, touch, vision, sensors, and IoT). We are inventing new technology along the way to overcome barriers and solve big problems. Tekion's flagship product offering, Automotive Retail Cloud™ is an industry-first cloud-native retail platform, including all functionalities of a Dealer Management System (DMS), and was launched recently.", "statement": "", "values": "", "offer": []}, {"name": "Times Internet", "socials": [["Website", "https://timesinternet.in/"], ["Twitter", "https://twitter.com/TimesInternet"], ["LinkedIn", "https://linkedin.com/company/timesinternet/"]], "founded": "1999", "employees": "5K - 10K", "about": "Times Internet builds premium digital products that simplify and enhance the everyday lives of people. They are India’s largest digital products company with a presence in a wide range of categories across news, entertainment, marketplaces, and transactions. Many of their products are market leaders and iconic brands in their own right. TOI, ET, Cricbuzz, Gaana, MX Player, Dineout, Indiatimes, MensXP, iDiva, NBT, Gradeup among others are products that bring you closer to your interests and aspirations.", "statement": "Times Internet Group's core mission is: WE INFORM, ENTERTAIN, AND ENABLE THE INDIAN CONSUMER.", "values": "", "offer": []}, {"name": "Toppr", "socials": [["Website", "https://toppr.com/"], ["Twitter", "https://twitter.com/mytoppr"], ["LinkedIn", "https://linkedin.com/company/toppr-com"]], "founded": "2013", "employees": "1K - 2.5K", "about": "Toppr is India's leading after-school learning app on a mission to make learning personalized. Toppr caters to the individual learning styles of students and provides the widest K12 syllabus coverage with 1 million course combinations and helps students prepare for various school, board, and competitive exams.", "statement": "Make Learning Personalised", "values": "Customer Happiness: Make a positive difference in the lives of our students Integrity: Maintain transparency in our processes and commitments Relentlessness: Set ambitious targets and work hard towards achieving them Speed: Do today, what we could do tomorrow Innovation: Reform the oldest industry and find better ways to do it Efficiency: Find quick and smart solutions to meet our goals Excellence: With every milestone, aim higher and strive to achieve it Empathy: Keep students first by putting ourselves in their shoes Nurturing: Grow by investing in people Openness: Do it like it should be done, tell it as it should be told", "offer": []}, {"name": "Tower Research", "socials": [["Website", "https://tower-research.com/"]], "founded": "", "employees": "", "about": "", "statement": "", "values": "", "offer": []}, {"name": "Traveloka", "socials": [["Website", "https://traveloka.com/"], ["LinkedIn", "https://linkedin.com/company/traveloka"]], "founded": "2012", "employees": "1K - 5K", "about": "Traveloka is Southeast Asia’s lifestyle super app with a mission to fulfill the travel and lifestyle aspirations of our users. Founded in 2012 by ex-Silicon Valley engineers, Traveloka set out to solve a central problem: simplifying travel from Indonesia to the world. That’s how we became Indonesia’s leading travel platform but today we are so much more. Their suite of products and services spanning across travel, local services, and financial services provides the users with an end-to-end solution for their travel and lifestyle needs. From transportation to accommodations, attractions to eateries, and insurance products to financial services, Traveloka want to empower the region’s fast-growing and highly aspirational consumers to enjoy new experiences and explore the world around them.", "statement": "Traveloka's mission is to empower you to fulfill your lifestyle aspirations.", "values": "", "offer": []}, {"name": "Truecaller", "socials": [["Website", "https://truecaller.com/"], ["Twitter", "https://twitter.com/Truecaller"], ["LinkedIn", "https://linkedin.com/company/truecaller"]], "founded": "2009", "employees": "201 - 500", "about": "Truecaller is the leading global platform for verifying contacts and blocking unwanted communication. It enables safe and relevant conversations between people and make it efficient for businesses to connect with consumers. Truecaller is on a mission to build trust in communication. Truecaller is an essential part of everyday communication for around 280 million active users, with half a billion downloads since launch and 30 billion unwanted calls identified and blocked. Headquartered in Stockholm, since 2009, Truecaller is a co-founder led, entrepreneurial company, with a highly experienced management team. ", "statement": "We are on a mission to build trust in communication. Truecaller is the leading global platform for verifying contacts and blocking unwanted communication. We enable safe and relevant conversations between people and make it efficient for business to connect with consumers. Fraud and unwanted communication are endemic to digital economies, especially in emerging markets. Truecaller is an essential part of everyday communication for around 280 million active users, with half a billion downloads since launch and 30 billion unwanted calls identified and blocked. At Truecaller, we aspire to make tomorrow's communication smarter, safer and more efficient. We were founded to create a service that would easily identify incoming calls from unknown phone numbers, but as the problem with fraud and unwanted communication grew, so did we.", "values": "Be fearlessWe take risks, are bold, and love exploring new challenges. Help each otherHelp is just a ‘hej’ away! We celebrate every win and learning, are prestigeless and work on a flat organization style. Get sh*t doneWe make fast decisions and keep it simple. Never give upWe strive for success, re-test our limits, and work together to bring our ideas to life.", "offer": []}, {"name": "Twilio", "socials": [["Website", "https://twilio.com/"], ["Twitter", "https://twitter.com/twilio"], ["LinkedIn", "https://linkedin.com/company/twilio-inc-"]], "founded": "2008", "employees": "5K - 10K", "about": "Twilio is a Cloud Communications Platform as a Service company based in San Francisco, California. It allows software developers to programmatically make and receive phone calls, send and receive text messages, and perform other communication functions using its web service APIs (audio, video, etc).", "statement": "Fuel the future of communication Millions of developers around the world have used Twilio to unlock the magic of communications to improve any human experience. Twilio has democratized communications channels like voice, text, chat, video, and email by virtualizing the world’s communications infrastructure through APIs that are simple enough for any developer to use, yet robust enough to power the world’s most demanding applications. By making communications a part of every software developer’s toolkit, Twilio is enabling innovators across every industry — from emerging leaders to the world’s largest organizations — to reinvent how companies engage with their customers.", "values": "Spend the time to deeply understand customers, and solve problems from their perspective. Earn trust through every interaction. Empower others We believe that unleashing human potential — both inside and outside our company — is the key to our success. Be humble and realize it’s not just about us. Invest in each other. Draw the owl There’s no instruction book, it’s ours to write. Figure it out, ship it, and iterate. Invent the future, but don’t wing it.", "offer": []}, {"name": "Twitter", "socials": [["Website", "https://about.twitter.com/"], ["Twitter", "https://twitter.com/Twitter"], ["LinkedIn", "https://linkedin.com/company/twitter/"]], "founded": "2006", "employees": "5K - 10K", "about": "Twitter is an American microblogging and social networking service. The platform is widely used by a lot of people across the world and clocks around 190 million users per day. Twitter is an open service that’s home to a world of diverse people, perspectives, ideas, and information. Twitter was created by Jack Dorsey, Noah Glass, Biz Stone, and Evan Williams in March 2006. Twitter is one of the most used social media platforms and offers a set of features for the users to connect with others and share information.", "statement": "Twitter's mission is to give everyone the power to create and share ideas and information instantly without barriers.", "values": "Twitter as a company lives by the following principles. Promoting healthFreedom of speech is a fundamental human right — but freedom to have that speech amplified by Twitter is not. Our rules exist to promote healthy conversations. Earning people’s trustTwitter is what’s happening. To stay reliable and credible, we must always be earning your trust.  Making it straightforwardSimple is good, but straightforward is better. Our product, our behavior, and our work habits should all be transparent and to the point. Uniting profit and purposeTwitter is a purpose-driven company that does good. Visit Twitter for Good to find out more about how we tie philanthropy to our business objectives. Being fast, free, and funWe should move fast, feel free to be ourselves, and have fun. That’s Twitter.", "offer": []}, {"name": "Uber", "socials": [["Website", "https://uber.com/"], ["Twitter", "https://twitter.com/Uber"], ["LinkedIn", "https://linkedin.com/company/uber-com"]], "founded": "2008", "employees": "10K+", "about": "Uber was born in 2008 and has grown into a global platform moving people and things in ever-expanding ways. Uber has gone from rides on four wheels to rides on two wheels to 18-wheel freight deliveries. From takeout meals to daily essentials to prescription drugs to just about anything you need at any time. From drivers with background checks to real-time verification to in-vehicle technology, Uber makes the passengers safer every single day. At Uber, the pursuit of reimagination is never finished, never stops, and is always just beginning.", "statement": "", "values": "Expanding accessWe believe broad access to an open marketplace creates greater opportunities for everyone. We aim to serve anyone’s need for mobility or work—anywhere and anytime. Delivering reliabilityWe believe the Uber network should work for everyone in the community. We strive to make every ride a great experience, and we design for a balanced and reliable marketplace for today and the future. Providing choiceWe believe flexibility and choice enable more freedom in mobility and work. We provide choices for both drivers and riders, and the network rewards choices that benefit the community. Aligning needsWe believe it is our responsibility to align the different and sometimes conflicting needs of riders and drivers. We build technology designed to provide reliable earnings for drivers and affordable prices for riders. We are also responsible for how value is shared across the network. Being upfrontWe believe everyone should be equipped with the right information to make the best decisions for their needs. We strive to be clear about pricing, matching, and how our technology affects riders and drivers.", "offer": []}, {"name": "Udaan", "socials": [["Website", "https://udaan.com/"], ["Twitter", "https://twitter.com/udaandotcom"], ["LinkedIn", "https://linkedin.com/company/udaan/"]], "founded": "2016", "employees": "5K - 10K", "about": "Founded in 2016 with a vision to transform the trade ecosystem in the country leveraging technology, Udaan is India’s largest b2b eCommerce platform that is empowering small businesses through the power and scale offered by eCommerce. It has operations across categories including lifestyle, electronics, home & kitchen, staples, fruits & vegetables, FMCG, pharma, toys, and general merchandise. Udaan has over 3 million users, 1.7 million retailers, chemists, kirana shops, HoReCa, farmers, and 30,000 sellers on the platform across the country.  The platform enables supply chain & logistics operations, which are based on sound technology, for daily delivery across 900 cities and 12,000 pin codes through udaanExpress. It enables financial products and trade credit services to small businesses, manufacturers, retailers, and buyers through udaanCapital to grow their business. Udaan enables small manufacturers, farmers, and brands to market and sells their products across the country at low cost with 100% payment security and complete transparency. While doing so it enables small businesses such as shopkeepers, kirana, restaurants, street vendors, chemists, offices, small factories, contractors, etc. to source from a large selection of high-quality products at the best prices while facilitating efficient and transparent transactions with a huge convenience. The platform’s SaaS offerings such as analysis of real-time marketing feedback through app data analytics enable brands and manufacturers to make well-informed decisions about product launches and testing of new products in different markets. While the app-based pricing system gives better pricing control, the product listing advertisements and in-app advertisements encourage manufacturers and wholesalers to reach their targeted, specific, and ready-to-purchase retailers on the platform. Udaan is headquartered in Bengaluru with offices in all leading metros and major cities across India.   ", "statement": "", "values": "", "offer": []}, {"name": "Ula", "socials": [["Website", "https://landing.ula.app/"], ["Twitter", "https://twitter.com/uladotapp"], ["LinkedIn", "https://linkedin.com/company/uladotapp/"]], "founded": "2020", "employees": "201 - 500", "about": "Ula leverages the power of technology to level the playing field for small retailers. Ula's ambitious and diverse team builds innovative solutions, addressing major pain points around supply chain and financial services to keep our retailers competitive in today's digital age. Their B2B marketplace provides small retailers competitive pricing, wide & accessible variety, and favorable payment terms, all at the push of a button.", "statement": "The vision of Ula is to combine the low cost, local structure of small stores with the power of technology, to increase their efficiency and grow their income.", "values": "The core values of Ula are: Customer drivenWe put our customers at heart of every decision Dare to be differentWe celebrate different perspectives and diversity of thoughts Stay HumbleHumility is a part of our customer empathy Build TogetherHierarchy is so old school. We are collectively building the Ula path", "offer": []}, {"name": "Unacademy", "socials": [["Website", "https://unacademy.com/"], ["Twitter", "https://twitter.com/unacademy"], ["LinkedIn", "https://linkedin.com/company/unacademy"]], "founded": "2015", "employees": "5K - 10K", "about": "Unacademy is an Indian educational technology company, based in Bangalore. It was originally started as a YouTube channel in 2010 by Gaurav Munjal. The company was officially founded in 2015. Unacademy is currently India’s largest online learning app.", "statement": "MissionDemocratise access to high quality education  VissionGet the best minds of the country to share knowledge in an easily comprehensible form.", "values": "", "offer": []}, {"name": "upGrad", "socials": [["Website", "https://upgrad.com/"], ["Twitter", "https://twitter.com/upGrad_edu"], ["LinkedIn", "https://linkedin.com/company/ueducation"]], "founded": "2015", "employees": "1K - 5K", "about": "upGrad is South Asia's largest online higher education company providing programs in Data Science, Technology, Management, and Law, to students, working professionals, and enterprises. The programs offered by upGrad are designed and delivered in collaboration with top universities across the world. With an 85% program completion rate, a robust tech platform, an outcome-based learning approach, industry-relevant curriculum, strong mentorship, and placement support, upGrad has established its position as the leader in the Indian education system and is well on its way to accomplishing its vision of powering career success for every member of global workforce as their trusted lifelong learning partner.", "statement": "VisionPowering career success for every member of the global workforce as their trusted lifelong learning partner. MissionMaking our learners achieve their desired outcomes.", "values": "The core values of upGrad are :AccountabilitySpeed Passion Integrity Respect Excellence", "offer": []}, {"name": "Upstox", "socials": [["Website", "https://upstox.com/"], ["Twitter", "https://twitter.com/upstox"], ["LinkedIn", "https://linkedin.com/company/upstox/"]], "founded": "2009", "employees": "501 - 1K", "about": "Upstox is an online investment brand of RKSV Securities. It is a SEBI registered financial service provider. RKSV offers online stock trading, commodity trading, currency derivatives trading, mutual funds, and Demat accounts. Upstox offers a fast, reliable & easy-to-use trading platform for traders in the Indian stock market.  Upstox offers low-cost trading services. The equity delivery (cash & carry) trading is offered for free to the customer. No brokerage is charged for orders placed in this segment. For all other trading segments across the exchange, Upstox charges flat Rs 20 per trade brokerage. It provides an excellent trading platform and tools to its customers. This includes Upstox Pro Web, Upstox MF, Upstox Pro Mobile, and Algo Lab, etc.", "statement": "", "values": "", "offer": []}, {"name": "Urban Company", "socials": [["Website", "https://urbancompany.com/"], ["Twitter", "https://twitter.com/urbanclap"], ["LinkedIn", "https://linkedin.com/company/urbancompany"]], "founded": "2014", "employees": "1K - 5K", "about": "Urban Company is Asia's largest home services company. We are an all-in-one platform that helps users hire premium service professionals, from beauticians and masseurs to sofa cleaners, carpenters, and technicians.Since its inception, Urban Company has built a network of 40,000+ trained service professionals and served over 5 million customers across major metropolitan cities of India, Dubai, Abu Dhabi, Sydney, and Singapore. Urban Company provides a platform that allows skilled and experienced professionals to connect with users looking for specific services. All the professionals, though experienced and skilled, undergo intensive training modules before being allowed to list their services on the platform. Once on the platform, our match-making algorithm identifies professionals who are closest to the users’ requirements and available at the requested time and date.", "statement": "To empower millions of service professionals by delivering services at-home in a way that has never been experienced before.", "values": "", "offer": []}, {"name": "VerSe Innovation", "socials": [["Website", "https://verse.in/"], ["Twitter", "https://twitter.com/VerSe_Corporate"], ["LinkedIn", "https://linkedin.com/company/verse-innovation/"]], "founded": "2007", "employees": "501 - 1K", "about": "VerSe Innovation’s proprietary technology platform powers 350 million + users to consume content in their local language on Dailyhunt. Their technology also powers India’s #1 and most engaging short video app Josh. With a substantial footprint in the value-added service ecosystem, VerSe broke new ground in the content and entertainment domain. This foray was augmented in large part owing to the company’s heavy investment in Artificial Intelligence and Machine Learning. Today, VerSe Innovation is a content technology platform company and India’s first tech unicorn focused on local languages.", "statement": "VisionTo create the world's largest, most inclusive platform for content creators and audiences.", "values": "", "offer": []}, {"name": "Vimeo", "socials": [["Website", "https://vimeo.com/"], ["Twitter", "https://twitter.com/Vimeo"], ["LinkedIn", "https://linkedin.com/company/vimeo/"]], "founded": "2004", "employees": "1K - 5K", "about": "Vimeo is the world’s leading all-in-one video software solution. Vimeo's platform enables any professional, team, and organization to unlock the power of video to create, collaborate and communicate. Vimeo serves a growing community of over 230 million users, from creatives to entrepreneurs to the world’s largest companies.", "statement": "Vimeo's purpose is to enable professional-quality video for all.", "values": "The core principles at Vimeo are: Start with UsersUnderstand our users’ goals, and make them your own. Solve for what users need, not what they ask for. Ask WhyRespectfully challenge ideas and embrace open debate. Validate intuitions with evidence. Aim HighBe willing to take risks to deliver outsized impact. Greatness only comes from making bold decisions. Own ItCommit to targets. Take the initiative, follow through and own the outcome. If processes are slowing you down, introduce better ones. Be RealSeek feedback and give it generously. Be direct. Be candid. Most of all, be you.", "offer": []}, {"name": "Visa", "socials": [["Website", "https://visa.co.in/"], ["Twitter", "https://twitter.com/Visa"], ["LinkedIn", "https://linkedin.com/company/visa/"]], "founded": "1958", "employees": "10K+", "about": "Visa is the world’s leader in digital payments. Visa's advanced global processing network, VisaNet, provides secure and reliable payments around the world and is capable of handling more than 65,000 transaction messages a second. The company’s relentless focus on innovation is a catalyst for the rapid growth of connected commerce on any device, and a driving force behind the dream of a cashless future for everyone, everywhere. As the world moves from analog to digital, Visa is applying our brand, products, people, network, and scale to reshape the future of commerce.", "statement": "Our Vision Our MissionCreate an environment in which individual differences, experiences and capabilities are valued and contribute to our business success.", "values": "The Code of Business Conduct and Ethics at Visa are: We Foster a Culture of Integrity We Respect Each Other We Avoid Conflicts of Interest We Protect Our Assets We Champion Financial Integrity We Uphold the Law", "offer": []}, {"name": "VMware", "socials": [["Website", "https://vmware.com/"], ["Twitter", "https://twitter.com/VMware"], ["LinkedIn", "https://linkedin.com/company/vmware/"]], "founded": "1998", "employees": "10K+", "about": "VMware is an American cloud computing and virtualization technology company that offers a breadth of digital solutions that powers apps, services, and experiences that enable organizations to deliver the best customer service and empower employees. VMware streamlines the journey for organizations to become digital businesses that deliver better experiences to their customers and empower employees to do their best work. Their software spans App Modernization, Cloud, Networking & Security, and Digital Workspace.", "statement": "VMware's vision is to empower people and organizations by radically simplifying IT through virtualization software.", "values": "VMware’s culture is based on a set of shared values expressed through the acronym EPIC2:Execution is a core value that encourages collaboration and high standards. VMware teams debate and discuss, and then get things done. Egos are checked at the door, and shared work is focused on impact, quality, and efficiency. Passion means challenging the status quo. VMware people are encouraged to follow their curiosity and the pursuit of the seemingly impossible to continuously make things better for customers, products, and each other. Integrity focuses on building trust. Employees are expected to say what they do and do what they say. The company encourages peers to build and nurture relationships with one another, customers, partners, shareholders, and the community—without taking anything for granted. Customers make it possible. They are core to VMware’s mission. The innovation that flows out of VMware frees customers from constraints and enables organizations of all types to meet their toughest technological challenges. Community acknowledges connection. Employees are encouraged to approach each other with open minds and humble hearts. Opportunities to serve by dedicating time, talent and energy are plentiful.", "offer": []}, {"name": "Walmart Labs", "socials": [["Website", "https://walmartlabs.com/"], ["Twitter", "https://twitter.com/Walmarttech?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor"], ["LinkedIn", "https://linkedin.com/company/walmartglobaltech/"]], "founded": "2011", "employees": "100K+", "about": "Walmart Labs is a part of Walmart Global Tech which is a team of 15,000+ software engineers, data scientists, and service professionals within Walmart, the world’s largest retailer, delivering innovations that improve how customers shop and empower over 2.2 million associates. Walmart Labs develop solutions that helps in increasing the efficiency and scale the supply chain used by Walmart across the world.  The team builds reusable technology and products to drive differentiated experiences for our customers, manage our extensive catalog, and power the supply chain. They also build and manage the foundational technologies on which the tech organization is built – including cloud, data, enterprise architecture, DevOps, infrastructure, and security. The team is also responsible for building a world-class enterprise services organization, including service operations and technology solutions for their 2.2 million associates worldwide.", "statement": "", "values": "The values that are at the core of Walmart are Service to the Customer Respect for the Individual Strive for Excellence Act with IntegrityCustomer-first: Listen to, anticipate and serve customer wants and needs Frontline focused: Support and empower associates to serve customers every day Innovative and agile: Be creative, take smart risks, and move with speed Listen: Be visible and available, collaborate with others and be open to feedback Lead by example: Be humble, teach and trust others to do their jobs, give honest and direct feedback Inclusive: Seek and embrace differences in people, ideas, and experiences High performance: Set and achieve aggressive goals Accountable: Take ownership, celebrate successes and be responsible for results Strategic: Make clear choices anticipate changing conditions, and plan for the future Honest: Tell the truth, keep your promises and be trustworthy Fair: Do right by others, be open and transparent Courageous: Speak up, ask for help, make tough calls and say no when appropriate", "offer": []}, {"name": "Yahoo", "socials": [["Website", "https://yahooinc.com/"], ["Twitter", "https://twitter.com/Yahoo"], ["LinkedIn", "https://linkedin.com/company/yahoo/"]], "founded": "1994", "employees": "10K+", "about": "Yahoo is a global media and tech company that connects people to their passions. Yahoo reaches nearly 900 million people around the world, bringing them closer to what they love—from finance and sports to shopping, gaming, and news—with the trusted products, content, and tech that fuel their day. For partners, Yahoo provides a full-stack platform for businesses to amplify growth and drive more meaningful connections across advertising, search, and media.", "statement": "", "values": "", "offer": []}, {"name": "Zenefits", "socials": [["Website", "https://zenefits.com/"], ["Twitter", "https://twitter.com/Zenefits"], ["LinkedIn", "https://linkedin.com/company/zenefits/"]], "founded": "2013", "employees": "501 - 1K", "about": "Zenefits is an American company that offers cloud-based software as a service to companies for managing their human resources, with a particular focus on helping them with payroll and health insurance coverage. The Zenefits People Platform brings everything HR into one radically simple, single app. Their platform is designed to be comprehensive without being overly complex. It puts benefits, payroll, and HR access in the pockets and at the fingertips of employees.", "statement": "At Zenefits, their mission is to level the playing field for the other 99.7% — the underserved small businesses that fuel our economy.", "values": "The core values at Zenefits are:  In it TogetherTogether, we can achieve anything. Put the Customer FirstOur customers’ interests are the heart of our decisions. Innovate for the Greater GoodOur solutions help the entire work ecosystem. Empathy over EgoWe strive to build an inclusive, accepting culture. Act Like an OwnerWe act like owners — with commitment, determination, and a bias for action. Operate with IntegrityWe have the courage to manifest our values in action.", "offer": []}, {"name": "Zerodha", "socials": [["Website", "https://zerodha.com/"], ["Twitter", "https://twitter.com/zerodhaonline"], ["LinkedIn", "https://linkedin.com/company/zerodha/"]], "founded": "2010", "employees": "1K - 5K", "about": "Zerodha is an Indian financial services company that offers brokerage-free equity investments, retail, institutional broking, currencies, and commodities trading. Founded in 2010, the company is headquartered in Bangalore and has a presence in nine Indian cities. It is also an official member of NSE's consultative committee for growing business. They offer a host of products for the public for investing and managing finances. Zerodha is now India's biggest Stockbroker and is also debt-free.", "statement": "Zerodha is firmly committed to working towards our vision of creating a brokerage-free world to benefit the most important stakeholders when it comes to the financial markets.", "values": "", "offer": []}, {"name": "ZestMoney", "socials": [["Website", "https://zestmoney.in/"], ["Twitter", "https://zestmoney.in/"], ["LinkedIn", "https://linkedin.com/company/zestmoney/"]], "founded": "2015", "employees": "501 - 1K", "about": "ZestMoney is the largest and fastest-growing consumer lending fintech company in India founded by Lizzie Chapman, Priya Sharma, and Ashish Anantharaman in 2015. ZestMoney is built as a platform that can meaningfully improve the lives of more than 300 million households in the country, who currently have no access to credit cards or any other formal financing options because of insufficient credit history.  ZestMoney’s unique platform uses mobile technology, digital banking, and Artificial Intelligence to make life more affordable to millions of Indian consumers by putting customers in touch with our lending partners and managing their credit for them. ZestMoney’s innovative technology and work to make affordable digital finance accessible led to their selection as a 2020 Technology Pioneer by the World Economic Forum. ", "statement": "ZestMoney's mission is to make life more affordable for India using technology-led solutions.", "values": "The core values of ZestMoney are: We listen to one anotherNo one is too small to be heard - and we’ve found it does wonders to the work. We keep it simpleWhat you see is what you get at Zest. And there’s nothing more energizing than a workplace that embraces that kind of honesty and transparency. Trust us, we know. We are less about work, more about purposeWe’re not a company that gives Indians credit. We’re a company that gives Indians credit that’s long overdue. See the difference? We believe the best is yet to comeWe are a company that is always work-in-progress. It helps us stay rooted, stay focussed.", "offer": []}, {"name": "Zeta", "socials": [["Website", "https://zeta.tech/"], ["Twitter", "https://twitter.com/zetasuite"], ["LinkedIn", "https://in.linkedin.com/company/zetasuite"]], "founded": "2015", "employees": "1K - 5K", "about": "Zeta is in the business of providing a full-stack, cloud-native, API-first neo-banking platform including a digital core and a payment engine for issuance of credit, debit, and prepaid products that enable legacy banks and new-age fintech institutions to launch modern retail and corporate fintech products. Co-founded by Bhavin Turakhia and Ramki Gaddipati, Zeta currently provides its platform and products to BFSI issuers in India, Asia, and LATAM. Zeta’s products are used by banks like RBL Bank, IDFC First Bank, and Kotak Mahindra Bank, 14000 corporates and over 2 million users, and clocks over 1 million transactions per day.", "statement": "Zeta's vision is to make payments invisible and seamless.", "values": "", "offer": []}, {"name": "Zomato", "socials": [["Website", "https://zomato.com/"], ["Twitter", "https://twitter.com/zomato"], ["LinkedIn", "https://linkedin.com/company/zomato"]], "founded": "2008", "employees": "10K+", "about": "Launched in 2010, Zomato is a technology platform that connects customers, restaurant partners, and delivery partners, serving their multiple needs. Customers use Zomato to search and discover restaurants, read and write customer-generated reviews and view and upload photos, order food delivery, book a table, and make payments while dining out at restaurants.  On the other hand, Zomato provides restaurant partners with industry-specific marketing tools which enable them to engage and acquire customers to grow their business while also providing a reliable and efficient last-mile delivery service. Zomato also operates a one-stop procurement solution, Hyperpure, which supplies high-quality ingredients and kitchen products to restaurant partners. Zomato also provides its delivery partners with transparent and flexible earning opportunities.", "statement": "Zomato’s mission statement is “better food for more people.”", "values": "", "offer": []}, {"name": "Zoom", "socials": [["Website", "https://zoom.us/"], ["Twitter", "https://twitter.com/zoom"], ["LinkedIn", "https://linkedin.com/company/zoom-video-communications/"]], "founded": "2011", "employees": "5K - 10K", "about": "Zoom offers a communications platform that started with video as its foundation and has set the standard for innovation ever since. Zoom is an intuitive, scalable, and secure choice for large enterprises, small businesses, and individuals alike. Zoom is one of the most-used communications tools by people across the world. Founded in 2011, Zoom is publicly traded and headquartered in San Jose, California.", "statement": "MissionMake video communications frictionless and secure VisionVideo communications empower people to accomplish more", "values": "The values at Zoom are:Care Community Care Customers Care Company Care Teammates  Care Selves", "offer": []}, {"name": "Zynga", "socials": [["Website", "https://zynga.com/"], ["Twitter", "https://twitter.com/zynga"], ["LinkedIn", "https://linkedin.com/company/zynga/"]], "founded": "2007", "employees": "1K - 5K", "about": "Zynga is a leading developer of the world's most popular social games that are played by millions of people around the world each day. Zynga was founded as a project by Mark Pincus in January of 2007 to create a social poker game to launch on The Facebook platform, which opened to third-party developers in May of that year. Today, Zynga is one of the largest developers of mobile games in the West with more than 183 million monthly active users playing its mobile games. Zynga was founded with the vision that play would become one of the core activities on the Internet. Zynga pioneered social games with the belief that if we could make games simple, accessible, and social the world would start playing. ", "statement": "Zynga's mission is to connect the world through games.", "values": "The core values at Zynga are: Build games you and your friends love to play Meritocracy level up Be CEO, own outcomes Move at Zynga speed Zynga first decisions for the greater good Innovate on best of breed mechanics", "offer": []}]